yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
#ifndef PCAP04_REGISTERS_H
#define PCAP04_REGISTERS_H

#include <stdint.h> // 包含stdint.h以使用uint8_t, uint16_t等标准整数类型

// --- PCAP04 I2C 从机地址 ---
// 注意: 实际的I2C从机地址通过寄存器0中的I2C_A位配置。
// 默认配置 (I2C_A = 0) 通常意味着设备响应0x28 (写) / 0x29 (读)
// 或0x50 (写) / 0x51 (读)，具体取决于芯片型号和I2C_A的解释。
// 此处以0x28作为示例基地址 (7位地址，用于8位读/写操作时需左移)。
#define PCAP04_I2C_BASE_ADDR        (0x28) // 示例7位I2C基地址

// --- PCAP04 寄存器地址定义 ---
// PCAP04共有64个寄存器，地址从0x00到0x3F
#define PCAP04_REG_ADDR_0           0x00
#define PCAP04_REG_ADDR_1           0x01
#define PCAP04_REG_ADDR_2           0x02
#define PCAP04_REG_ADDR_3           0x03
#define PCAP04_REG_ADDR_4           0x04
#define PCAP04_REG_ADDR_5           0x05
#define PCAP04_REG_ADDR_6           0x06
#define PCAP04_REG_ADDR_7           0x07
#define PCAP04_REG_ADDR_8           0x08
#define PCAP04_REG_ADDR_9           0x09
#define PCAP04_REG_ADDR_10          0x0A
#define PCAP04_REG_ADDR_11          0x0B
#define PCAP04_REG_ADDR_12          0x0C
#define PCAP04_REG_ADDR_13          0x0D
#define PCAP04_REG_ADDR_14          0x0E
#define PCAP04_REG_ADDR_15          0x0F
#define PCAP04_REG_ADDR_16          0x10
#define PCAP04_REG_ADDR_17          0x11
#define PCAP04_REG_ADDR_18          0x12
#define PCAP04_REG_ADDR_19          0x13
#define PCAP04_REG_ADDR_20          0x14
#define PCAP04_REG_ADDR_21          0x15
#define PCAP04_REG_ADDR_22          0x16
#define PCAP04_REG_ADDR_23          0x17
#define PCAP04_REG_ADDR_24          0x18
#define PCAP04_REG_ADDR_25          0x19
#define PCAP04_REG_ADDR_26          0x1A
#define PCAP04_REG_ADDR_27          0x1B
#define PCAP04_REG_ADDR_28          0x1C
#define PCAP04_REG_ADDR_29          0x1D
#define PCAP04_REG_ADDR_30          0x1E
#define PCAP04_REG_ADDR_31          0x1F
#define PCAP04_REG_ADDR_32          0x20
#define PCAP04_REG_ADDR_33          0x21
#define PCAP04_REG_ADDR_34          0x22
#define PCAP04_REG_ADDR_35          0x23
#define PCAP04_REG_ADDR_36          0x24 
#define PCAP04_REG_ADDR_37          0x25 
#define PCAP04_REG_ADDR_38          0x26
#define PCAP04_REG_ADDR_39          0x27
#define PCAP04_REG_ADDR_40          0x28
#define PCAP04_REG_ADDR_41          0x29
#define PCAP04_REG_ADDR_42          0x2A
#define PCAP04_REG_ADDR_43          0x2B // 保留
#define PCAP04_REG_ADDR_44          0x2C // 保留
#define PCAP04_REG_ADDR_45          0x2D // 保留
#define PCAP04_REG_ADDR_46          0x2E // 保留
#define PCAP04_REG_ADDR_47          0x2F
#define PCAP04_REG_ADDR_48          0x30
#define PCAP04_REG_ADDR_49          0x31
#define PCAP04_REG_ADDR_50          0x32
#define PCAP04_REG_ADDR_51          0x33 // ams内部寄存器
#define PCAP04_REG_ADDR_52          0x34 // ams内部寄存器
#define PCAP04_REG_ADDR_53          0x35 // ams内部寄存器
#define PCAP04_REG_ADDR_54          0x36
#define PCAP04_REG_ADDR_55          0x37 // ams内部寄存器
#define PCAP04_REG_ADDR_56          0x38 // ams内部寄存器
#define PCAP04_REG_ADDR_57          0x39 // ams内部寄存器
#define PCAP04_REG_ADDR_58          0x3A // ams内部寄存器
#define PCAP04_REG_ADDR_59          0x3B // ams内部寄存器
#define PCAP04_REG_ADDR_60          0x3C // ams内部寄存器
#define PCAP04_REG_ADDR_61          0x3D // ams内部寄存器
#define PCAP04_REG_ADDR_62          0x3E // 电荷泵配置 (禁止修改)
#define PCAP04_REG_ADDR_63          0x3F // 电荷泵配置 (禁止修改)


// ============================================================================
// 各寄存器的位域定义（按寄存器顺序排列）
// ============================================================================

// ----------------------------------------------------------------------------
// 寄存器 0 (0x00) - IIC地址与低频时钟配置
// ----------------------------------------------------------------------------
// 位[7:6] I2C_A: I²C设备地址补码配置（用于设置I²C从机地址）
#define PCAP04_REG0_I2C_A_SHIFT             6
#define PCAP04_REG0_I2C_A_MASK              (0x03 << PCAP04_REG0_I2C_A_SHIFT)
#define PCAP04_REG0_I2C_A_bit(val)          (((val) & 0x03) << PCAP04_REG0_I2C_A_SHIFT)

// 位[5:2] OLF_FTUNE: 低频时钟微调（范围: 0-15）
#define PCAP04_REG0_OLF_FTUNE_SHIFT         2
#define PCAP04_REG0_OLF_FTUNE_MASK          (0x0F << PCAP04_REG0_OLF_FTUNE_SHIFT)
#define PCAP04_REG0_OLF_FTUNE_bit(val)       (((val) & 0x0F) << PCAP04_REG0_OLF_FTUNE_SHIFT)
#define PCAP04_REG0_OLF_FTUNE_MIN           0   // 最小值
#define PCAP04_REG0_OLF_FTUNE_TYPICAL       7   // 典型值 (推荐)
#define PCAP04_REG0_OLF_FTUNE_MAX           15  // 最大值

// 位[1:0] OLF_CTUNE: 低频时钟粗调
#define PCAP04_REG0_OLF_CTUNE_SHIFT         0
#define PCAP04_REG0_OLF_CTUNE_MASK          (0x03 << PCAP04_REG0_OLF_CTUNE_SHIFT)
#define PCAP04_REG0_OLF_CTUNE_bit(val)      (((val) & 0x03) << PCAP04_REG0_OLF_CTUNE_SHIFT)
#define PCAP04_REG0_OLF_CTUNE_10k           0x00  // 10 kHz
#define PCAP04_REG0_OLF_CTUNE_50k           0x01  // 50 kHz
#define PCAP04_REG0_OLF_CTUNE_100k          0x02  // 100 kHz
#define PCAP04_REG0_OLF_CTUNE_200k          0x03  // 200 kHz (推荐)

// 寄存器0完整值构建宏
#define PCAP04_REG0_VALUE(i2c_a, olf_ftune, olf_ctune) \
    (PCAP04_REG0_I2C_A_bit(i2c_a) | PCAP04_REG0_OLF_FTUNE_bit(olf_ftune) | PCAP04_REG0_OLF_CTUNE_bit(olf_ctune))

// ----------------------------------------------------------------------------
// 寄存器 1 (0x01) - 外部晶振时钟OX配置
// ----------------------------------------------------------------------------
// 位[7] OX_DIS: 禁用OX时钟
#define PCAP04_REG1_OX_DIS_SHIFT            7
#define PCAP04_REG1_OX_DIS_MASK             (0x01 << PCAP04_REG1_OX_DIS_SHIFT)
#define PCAP04_REG1_OX_DIS_bit(val)         (((val) & 0x01) << PCAP04_REG1_OX_DIS_SHIFT)
#define PCAP04_REG1_OX_DIS_ENABLE           0  // 启用 (默认)
#define PCAP04_REG1_OX_DIS_DISABLE          1  // 禁用

// 位[5] OX_DIV4: OX时钟4分频
#define PCAP04_REG1_OX_DIV4_SHIFT           5
#define PCAP04_REG1_OX_DIV4_MASK            (0x01 << PCAP04_REG1_OX_DIV4_SHIFT)
#define PCAP04_REG1_OX_DIV4_bit(val)        (((val) & 0x01) << PCAP04_REG1_OX_DIV4_SHIFT)
#define PCAP04_REG1_OX_DIV4_NO_DIV          0  // 不分频，f_ox = 2MHz
#define PCAP04_REG1_OX_DIV4_DIV4            1  // 4分频，f_ox = 0.5MHz

// 位[4] OX_AUTOSTOP_DIS: ams内部位 (默认: 0)
#define PCAP04_REG1_OX_AUTOSTOP_DIS_SHIFT   4
#define PCAP04_REG1_OX_AUTOSTOP_DIS_MASK    (0x01 << PCAP04_REG1_OX_AUTOSTOP_DIS_SHIFT)
#define PCAP04_REG1_OX_AUTOSTOP_DIS_bit(val) (((val) & 0x01) << PCAP04_REG1_OX_AUTOSTOP_DIS_SHIFT)

// 位[3] OX_STOP: ams内部位 (默认: 0)
#define PCAP04_REG1_OX_STOP_SHIFT           3
#define PCAP04_REG1_OX_STOP_MASK            (0x01 << PCAP04_REG1_OX_STOP_SHIFT)
#define PCAP04_REG1_OX_STOP_bit(val)        (((val) & 0x01) << PCAP04_REG1_OX_STOP_SHIFT)

// 位[2:0] OX_RUN: 控制OX发生器的持续性或延迟
#define PCAP04_REG1_OX_RUN_SHIFT            0
#define PCAP04_REG1_OX_RUN_MASK             (0x07 << PCAP04_REG1_OX_RUN_SHIFT)
#define PCAP04_REG1_OX_RUN_bit(val)         (((val) & 0x07) << PCAP04_REG1_OX_RUN_SHIFT)
#define PCAP04_REG1_OX_RUN_OFF               0x00  // 发生器关闭
#define PCAP04_REG1_OX_RUN_PERMANENT        0x01  // OX永久运行
#define PCAP04_REG1_OX_RUN_DELAY31_fOLF     0x02  // OX延迟 = 31 / fOLF
#define PCAP04_REG1_OX_RUN_DELAY2_fOLF      0x03  // OX延迟 = 2 / fOLF
#define PCAP04_REG1_OX_RUN_DELAY1_fOLF      0x06  // OX延迟 = 1 / fOLF

// 寄存器1完整值构建宏（ams内部位OX_AUTOSTOP_DIS和OX_STOP使用默认值0，无需输入）
#define PCAP04_REG1_VALUE(ox_dis, ox_div4, ox_run) \
    (PCAP04_REG1_OX_DIS_bit(ox_dis) | PCAP04_REG1_OX_DIV4_bit(ox_div4) | \
     PCAP04_REG1_OX_AUTOSTOP_DIS_bit(0) | PCAP04_REG1_OX_STOP_bit(0) | \
     PCAP04_REG1_OX_RUN_bit(ox_run))

// ----------------------------------------------------------------------------
// 寄存器 2 (0x02) - 端口放电电阻配置
// ----------------------------------------------------------------------------
// 位[7:6] RDCHG_INT_SEL1: PC4~PC5的片上放电电阻选择
#define PCAP04_REG2_RDCHG_INT_SEL1_SHIFT    6
#define PCAP04_REG2_RDCHG_INT_SEL1_MASK     (0x03 << PCAP04_REG2_RDCHG_INT_SEL1_SHIFT)
#define PCAP04_REG2_RDCHG_INT_SEL1_bit(val) (((val) & 0x03) << PCAP04_REG2_RDCHG_INT_SEL1_SHIFT)
#define PCAP04_REG2_RDCHG_INT_SEL1_180K     0x00  // 180 kΩ
#define PCAP04_REG2_RDCHG_INT_SEL1_90K      0x01  // 90 kΩ
#define PCAP04_REG2_RDCHG_INT_SEL1_30K      0x02  // 30 kΩ (默认，推荐)
#define PCAP04_REG2_RDCHG_INT_SEL1_10K      0x03  // 10 kΩ

