yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 位[5:4] RDCHG_INT_SEL0: PC0~PC3和内部端口PC6的片上放电电阻选择
#define PCAP04_REG2_RDCHG_INT_SEL0_SHIFT    4
#define PCAP04_REG2_RDCHG_INT_SEL0_MASK     (0x03 << PCAP04_REG2_RDCHG_INT_SEL0_SHIFT)
#define PCAP04_REG2_RDCHG_INT_SEL0_bit(val) (((val) & 0x03) << PCAP04_REG2_RDCHG_INT_SEL0_SHIFT)
#define PCAP04_REG2_RDCHG_INT_SEL0_180K     0x00  // 180 kΩ
#define PCAP04_REG2_RDCHG_INT_SEL0_90K      0x01  // 90 kΩ
#define PCAP04_REG2_RDCHG_INT_SEL0_30K      0x02  // 30 kΩ (默认，推荐)
#define PCAP04_REG2_RDCHG_INT_SEL0_10K      0x03  // 10 kΩ

// 位[3] RDCHG_INT_EN: 内部放电电阻使能
#define PCAP04_REG2_RDCHG_INT_EN_SHIFT      3
#define PCAP04_REG2_RDCHG_INT_EN_MASK       (0x01 << PCAP04_REG2_RDCHG_INT_EN_SHIFT)
#define PCAP04_REG2_RDCHG_INT_EN_bit(val)   (((val) & 0x01) << PCAP04_REG2_RDCHG_INT_EN_SHIFT)
#define PCAP04_REG2_RDCHG_INT_EN_DISABLE    0  // 关闭
#define PCAP04_REG2_RDCHG_INT_EN_ENABLE     1  // 内部开启 (默认)

// 位[1] RDCHG_EXT_EN: 外部放电电阻使能
#define PCAP04_REG2_RDCHG_EXT_EN_SHIFT      1
#define PCAP04_REG2_RDCHG_EXT_EN_MASK       (0x01 << PCAP04_REG2_RDCHG_EXT_EN_SHIFT)
#define PCAP04_REG2_RDCHG_EXT_EN_bit(val)   (((val) & 0x01) << PCAP04_REG2_RDCHG_EXT_EN_SHIFT)
#define PCAP04_REG2_RDCHG_EXT_EN_DISABLE    0  // 关闭 (默认)
#define PCAP04_REG2_RDCHG_EXT_EN_ENABLE     1  // 外部开启

// 寄存器2完整值构建宏
#define PCAP04_REG2_VALUE(sel1, sel0, int_en, ext_en) \
    (PCAP04_REG2_RDCHG_INT_SEL1_bit(sel1) | PCAP04_REG2_RDCHG_INT_SEL0_bit(sel0) | \
     PCAP04_REG2_RDCHG_INT_EN_bit(int_en) | PCAP04_REG2_RDCHG_EXT_EN_bit(ext_en))

// ----------------------------------------------------------------------------
// 寄存器 3 (0x03) - 端口充放电电阻配置
// ----------------------------------------------------------------------------
// 位[6] AUX_PD_DIS: 禁用PCAUX下拉电阻
#define PCAP04_REG3_AUX_PD_DIS_SHIFT        6
#define PCAP04_REG3_AUX_PD_DIS_MASK         (0x01 << PCAP04_REG3_AUX_PD_DIS_SHIFT)
#define PCAP04_REG3_AUX_PD_DIS_bit(val)     (((val) & 0x01) << PCAP04_REG3_AUX_PD_DIS_SHIFT)
#define PCAP04_REG3_AUX_PD_DIS_ACTIVE       0  // 下拉激活 (默认)
#define PCAP04_REG3_AUX_PD_DIS_DISABLE      1  // 下拉禁用

// 位[5] AUX_CINT: 仅在内部参考转换期间激活辅助端口PCAUX
#define PCAP04_REG3_AUX_CINT_SHIFT          5
#define PCAP04_REG3_AUX_CINT_MASK           (0x01 << PCAP04_REG3_AUX_CINT_SHIFT)
#define PCAP04_REG3_AUX_CINT_bit(val)       (((val) & 0x01) << PCAP04_REG3_AUX_CINT_SHIFT)
#define PCAP04_REG3_AUX_CINT_NORMAL         0  // 正常 (默认)
#define PCAP04_REG3_AUX_CINT_ACTIVE         1  // 在内部c参考转换期间激活辅助端口

// 位[4:3] RDCHG_OPEN: ams内部位 (推荐值: 2)
#define PCAP04_REG3_RDCHG_OPEN_SHIFT        3
#define PCAP04_REG3_RDCHG_OPEN_MASK         (0x03 << PCAP04_REG3_RDCHG_OPEN_SHIFT)
#define PCAP04_REG3_RDCHG_OPEN_bit(val)     (((val) & 0x03) << PCAP04_REG3_RDCHG_OPEN_SHIFT)

// 位[2] RDCHG_PERM_EN: 保持芯片内部放电电阻永久连接
#define PCAP04_REG3_RDCHG_PERM_EN_SHIFT     2
#define PCAP04_REG3_RDCHG_PERM_EN_MASK      (0x01 << PCAP04_REG3_RDCHG_PERM_EN_SHIFT)
#define PCAP04_REG3_RDCHG_PERM_EN_bit(val)  (((val) & 0x01) << PCAP04_REG3_RDCHG_PERM_EN_SHIFT)
#define PCAP04_REG3_RDCHG_PERM_EN_DISABLE   0  // 关闭 (默认)
#define PCAP04_REG3_RDCHG_PERM_EN_ENABLE    1  // 开启

// 位[1] RDCHG_EXT_PERM: 永久激活辅助端口PCAUX
#define PCAP04_REG3_RDCHG_EXT_PERM_SHIFT    1
#define PCAP04_REG3_RDCHG_EXT_PERM_MASK     (0x01 << PCAP04_REG3_RDCHG_EXT_PERM_SHIFT)
#define PCAP04_REG3_RDCHG_EXT_PERM_bit(val) (((val) & 0x01) << PCAP04_REG3_RDCHG_EXT_PERM_SHIFT)
#define PCAP04_REG3_RDCHG_EXT_PERM_DISABLE  0  // 关闭 (默认)
#define PCAP04_REG3_RDCHG_EXT_PERM_ENABLE   1  // 开启

// 位[0] RCHG_SEL: 选择充电电阻
#define PCAP04_REG3_RCHG_SEL_SHIFT          0
#define PCAP04_REG3_RCHG_SEL_MASK           (0x01 << PCAP04_REG3_RCHG_SEL_SHIFT)
#define PCAP04_REG3_RCHG_SEL_bit(val)       (((val) & 0x01) << PCAP04_REG3_RCHG_SEL_SHIFT)
#define PCAP04_REG3_RCHG_SEL_180K           0x00  // 180 kΩ
#define PCAP04_REG3_RCHG_SEL_10K            0x01  // 10 kΩ (默认)

// 寄存器3完整值构建宏（ams内部位RDCHG_OPEN使用默认值0，无需输入）
#define PCAP04_REG3_VALUE(aux_pd_dis, aux_cint, rdchg_perm_en, rdchg_ext_perm, rchg_sel) \
    (PCAP04_REG3_AUX_PD_DIS_bit(aux_pd_dis) | PCAP04_REG3_AUX_CINT_bit(aux_cint) | \
     PCAP04_REG3_RDCHG_OPEN_bit(2) | PCAP04_REG3_RDCHG_PERM_EN_bit(rdchg_perm_en) | \
     PCAP04_REG3_RDCHG_EXT_PERM_bit(rdchg_ext_perm) | PCAP04_REG3_RCHG_SEL_bit(rchg_sel))

// ----------------------------------------------------------------------------
// 寄存器 4 (0x04) - 端口电容连接方式
// ----------------------------------------------------------------------------
// 位[7] C_REF_INT: 使用片上参考电容（bit7用于选择使用外部参考电容或内部参考电容，内部参考电容值为1~31pF，如果我们需要测量的电容大于500pF时，务必使用外部参考电容）
#define PCAP04_REG4_C_REF_INT_SHIFT         7
#define PCAP04_REG4_C_REF_INT_MASK          (0x01 << PCAP04_REG4_C_REF_INT_SHIFT)
#define PCAP04_REG4_C_REF_INT_bit(val)      (((val) & 0x01) << PCAP04_REG4_C_REF_INT_SHIFT)
#define PCAP04_REG4_C_REF_INT_EXTERNAL      0  // 外部参考 (默认)
#define PCAP04_REG4_C_REF_INT_INTERNAL      1  // 内部参考

// 位[5] C_COMP_EXT: 激活外部寄生电容补偿机制（bit5为外部寄生电容补偿位，建议开启，这样芯片内部将会通过内部电路独立放电来测试寄生电容对测量值进行修正）
#define PCAP04_REG4_C_COMP_EXT_SHIFT        5
#define PCAP04_REG4_C_COMP_EXT_MASK         (0x01 << PCAP04_REG4_C_COMP_EXT_SHIFT)
#define PCAP04_REG4_C_COMP_EXT_bit(val)     (((val) & 0x01) << PCAP04_REG4_C_COMP_EXT_SHIFT)
#define PCAP04_REG4_C_COMP_EXT_IDLE         0  // 空闲 (默认)
#define PCAP04_REG4_C_COMP_EXT_ACTIVE        1  // 激活

// 位[4] C_COMP_INT: 激活片上寄生电容补偿机制和增益补偿（bit4为内部寄生电容补偿位）
#define PCAP04_REG4_C_COMP_INT_SHIFT        4
#define PCAP04_REG4_C_COMP_INT_MASK         (0x01 << PCAP04_REG4_C_COMP_INT_SHIFT)
#define PCAP04_REG4_C_COMP_INT_bit(val)     (((val) & 0x01) << PCAP04_REG4_C_COMP_INT_SHIFT)
#define PCAP04_REG4_C_COMP_INT_IDLE         0  // 空闲 (默认)
#define PCAP04_REG4_C_COMP_INT_ACTIVE        1  // 激活

// 位[1] C_DIFFERENTIAL: 选择单端或差分传感器（bit1和bit0用于是独立测量还是差分测量）
#define PCAP04_REG4_C_DIFFERENTIAL_SHIFT    1
#define PCAP04_REG4_C_DIFFERENTIAL_MASK     (0x01 << PCAP04_REG4_C_DIFFERENTIAL_SHIFT)
#define PCAP04_REG4_C_DIFFERENTIAL_bit(val) (((val) & 0x01) << PCAP04_REG4_C_DIFFERENTIAL_SHIFT)
#define PCAP04_REG4_C_DIFFERENTIAL_SINGLE_ENDED  0  // 普通 (单端) (默认)
#define PCAP04_REG4_C_DIFFERENTIAL_DIFF         1  // 差分

// 位[0] C_FLOATING: 选择接地或浮动传感器
#define PCAP04_REG4_C_FLOATING_SHIFT        0
#define PCAP04_REG4_C_FLOATING_MASK         (0x01 << PCAP04_REG4_C_FLOATING_SHIFT)
#define PCAP04_REG4_C_FLOATING_bit(val)     (((val) & 0x01) << PCAP04_REG4_C_FLOATING_SHIFT)
#define PCAP04_REG4_C_FLOATING_GROUNDED      0  // 接地 (默认)
#define PCAP04_REG4_C_FLOATING_FLOATING      1  // 浮动

// 寄存器4完整值构建宏
#define PCAP04_REG4_VALUE(c_ref_int, c_comp_ext, c_comp_int, c_differential, c_floating) \
    (PCAP04_REG4_C_REF_INT_bit(c_ref_int) | PCAP04_REG4_C_COMP_EXT_bit(c_comp_ext) | \
     PCAP04_REG4_C_COMP_INT_bit(c_comp_int) | PCAP04_REG4_C_DIFFERENTIAL_bit(c_differential) | \
     PCAP04_REG4_C_FLOATING_bit(c_floating))

// ----------------------------------------------------------------------------
// 寄存器 5 (0x05) - CDC时钟与端口模式配置
// ----------------------------------------------------------------------------
// 位[7] CY_PRE_MR1_SHORT: 减少内部时钟路径之间的延迟
#define PCAP04_REG5_CY_PRE_MR1_SHORT_SHIFT  7
#define PCAP04_REG5_CY_PRE_MR1_SHORT_MASK   (0x01 << PCAP04_REG5_CY_PRE_MR1_SHORT_SHIFT)
#define PCAP04_REG5_CY_PRE_MR1_SHORT_bit(val) (((val) & 0x01) << PCAP04_REG5_CY_PRE_MR1_SHORT_SHIFT)
#define PCAP04_REG5_CY_PRE_MR1_SHORT_NORMAL  0  // 正常 (推荐)
#define PCAP04_REG5_CY_PRE_MR1_SHORT_REDUCE  1  // 减少

// 位[5] C_PORT_PAT: 端口测量顺序交替（如果激活C_PORT_PAT，则C_AVRG + C_FAKE应为偶数）
#define PCAP04_REG5_C_PORT_PAT_SHIFT        5
#define PCAP04_REG5_C_PORT_PAT_MASK         (0x01 << PCAP04_REG5_C_PORT_PAT_SHIFT)
#define PCAP04_REG5_C_PORT_PAT_bit(val)     (((val) & 0x01) << PCAP04_REG5_C_PORT_PAT_SHIFT)
#define PCAP04_REG5_C_PORT_PAT_NORMAL        0  // 正常
#define PCAP04_REG5_C_PORT_PAT_ALTERNATE     1  // 端口顺序交替（每次序列后反转测量端口的顺序）

// 位[3] CY_HFCLK_SEL: CDC时钟源选择
#define PCAP04_REG5_CY_HFCLK_SEL_SHIFT      3
#define PCAP04_REG5_CY_HFCLK_SEL_MASK       (0x01 << PCAP04_REG5_CY_HFCLK_SEL_SHIFT)
#define PCAP04_REG5_CY_HFCLK_SEL_bit(val)   (((val) & 0x01) << PCAP04_REG5_CY_HFCLK_SEL_SHIFT)
#define PCAP04_REG5_CY_HFCLK_SEL_OLF        0  // OLF (低频时钟) (默认)
#define PCAP04_REG5_CY_HFCLK_SEL_OHF        1  // OHF (高频时钟)

