yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 位[2] CY_DIV4_DIS: 四倍时钟周期（仅在与CY_HFCLK_SEL == 1组合时）
#define PCAP04_REG5_CY_DIV4_DIS_SHIFT       2
#define PCAP04_REG5_CY_DIV4_DIS_MASK        (0x01 << PCAP04_REG5_CY_DIV4_DIS_SHIFT)
#define PCAP04_REG5_CY_DIV4_DIS_bit(val)    (((val) & 0x01) << PCAP04_REG5_CY_DIV4_DIS_SHIFT)
#define PCAP04_REG5_CY_DIV4_DIS_DISABLE      0  // 关闭
#define PCAP04_REG5_CY_DIV4_DIS_ENABLE       1  // 开启

// 位[1] CY_PRE_LONG: 在内部时钟路径之间添加安全延迟
#define PCAP04_REG5_CY_PRE_LONG_SHIFT       1
#define PCAP04_REG5_CY_PRE_LONG_MASK        (0x01 << PCAP04_REG5_CY_PRE_LONG_SHIFT)
#define PCAP04_REG5_CY_PRE_LONG_bit(val)    (((val) & 0x01) << PCAP04_REG5_CY_PRE_LONG_SHIFT)
#define PCAP04_REG5_CY_PRE_LONG_DISABLE      0  // 关闭 (推荐)
#define PCAP04_REG5_CY_PRE_LONG_ENABLE       1  // 开启

// 位[0] C_DC_BALANCE: 仅用于差分浮动模式
#define PCAP04_REG5_C_DC_BALANCE_SHIFT      0
#define PCAP04_REG5_C_DC_BALANCE_MASK       (0x01 << PCAP04_REG5_C_DC_BALANCE_SHIFT)
#define PCAP04_REG5_C_DC_BALANCE_bit(val)   (((val) & 0x01) << PCAP04_REG5_C_DC_BALANCE_SHIFT)
#define PCAP04_REG5_C_DC_BALANCE_DISABLE     0  // 关闭 ("single HiZ")
#define PCAP04_REG5_C_DC_BALANCE_ENABLE      1  // 直流自由 ("both HiZ")

// 寄存器5完整值构建宏
#define PCAP04_REG5_VALUE(cy_pre_mr1_short, c_port_pat, cy_hfclk_sel, cy_div4_dis, cy_pre_long, c_dc_balance) \
    (PCAP04_REG5_CY_PRE_MR1_SHORT_bit(cy_pre_mr1_short) | PCAP04_REG5_C_PORT_PAT_bit(c_port_pat) | \
     PCAP04_REG5_CY_HFCLK_SEL_bit(cy_hfclk_sel) | PCAP04_REG5_CY_DIV4_DIS_bit(cy_div4_dis) | \
     PCAP04_REG5_CY_PRE_LONG_bit(cy_pre_long) | PCAP04_REG5_C_DC_BALANCE_bit(c_dc_balance))

// ----------------------------------------------------------------------------
// 寄存器 6 (0x06) - 测量端口使能配置
// ----------------------------------------------------------------------------
// 位[5:0] C_PORT_EN: 位使能CDC端口（PC0到PC5）（寄存器6为电容采集通道开关配置使用，PCAP04最大支持六路电容采集，如果需要开启相应的通道，只需要将对应位置1即可，例如0x0F则表示通道0~3开启）
#define PCAP04_REG6_C_PORT_EN_SHIFT         0
#define PCAP04_REG6_C_PORT_EN_MASK          (0x3F << PCAP04_REG6_C_PORT_EN_SHIFT)
#define PCAP04_REG6_C_PORT_EN_bit(val)      (((val) & 0x3F) << PCAP04_REG6_C_PORT_EN_SHIFT)
// 单独端口使能位
#define PCAP04_REG6_C_PORT_EN_PC0           (1 << 0) // 启用PC0
#define PCAP04_REG6_C_PORT_EN_PC1           (1 << 1) // 启用PC1
#define PCAP04_REG6_C_PORT_EN_PC2           (1 << 2) // 启用PC2
#define PCAP04_REG6_C_PORT_EN_PC3           (1 << 3) // 启用PC3
#define PCAP04_REG6_C_PORT_EN_PC4           (1 << 4) // 启用PC4
#define PCAP04_REG6_C_PORT_EN_PC5           (1 << 5) // 启用PC5
#define PCAP04_REG6_C_PORT_EN_ALL            (PCAP04_REG6_C_PORT_EN_PC0 | PCAP04_REG6_C_PORT_EN_PC1 | \
                                             PCAP04_REG6_C_PORT_EN_PC2 | PCAP04_REG6_C_PORT_EN_PC3 | \
                                             PCAP04_REG6_C_PORT_EN_PC4 | PCAP04_REG6_C_PORT_EN_PC5) // 0x3F (全部启用)

// 寄存器6完整值构建宏
#define PCAP04_REG6_VALUE(port_en)          PCAP04_REG6_C_PORT_EN_bit(port_en)

// ----------------------------------------------------------------------------
// 寄存器 7-8 (0x07, 0x08) - 采样平均配置 (C_AVRG, 13位)
// ----------------------------------------------------------------------------
// C_AVRG: 设置CDC测量的平均采样数（范围: 0-8191，寄存器7-8用于配置计算平均值时的采样次数，最大可以到8191次，也就是电容值是采样8191次之后的平均值，这个值越大，采样值越平稳，但对应的采样时间也会越长，这个根据实际需要配置）
#define PCAP04_C_AVRG_MAX           8191
// 寄存器7: C_AVRG的低8位
#define PCAP04_REG7_C_AVRG_LOW_bit(val)     ((uint8_t)((val) & 0xFF))
// 寄存器8: C_AVRG的高5位（位[4:0]）
#define PCAP04_REG8_C_AVRG_HIGH_bit(val)    ((uint8_t)(((val) >> 8) & 0x1F))

// ----------------------------------------------------------------------------
// 寄存器 9-11 (0x09, 0x0A, 0x0B) - 转换时间配置 (CONV_TIME, 23位)
// ----------------------------------------------------------------------------
// CONV_TIME: 转换触发周期或序列周期（范围: 0-0x7FFFFF，公式: Tconv/seq = 2 × CONV_TIME / fOLF，例如配置0x0007D0 = 2000，如果OLF = 200 kHz，则 Tconv = 2 × 2000 / 200000 = 20 ms）
#define PCAP04_CONV_TIME_MAX        0x7FFFFF
// 寄存器9: CONV_TIME的低8位
#define PCAP04_REG9_CONV_TIME_LOW_bit(val)  ((uint8_t)((val) & 0xFF))
// 寄存器10: CONV_TIME的中间8位
#define PCAP04_REG10_CONV_TIME_MID_bit(val)  ((uint8_t)(((val) >> 8) & 0xFF))
// 寄存器11: CONV_TIME的高7位（位[6:0]）
#define PCAP04_REG11_CONV_TIME_HIGH_bit(val) ((uint8_t)(((val) >> 16) & 0x7F))

// ----------------------------------------------------------------------------
// 寄存器 12-13 (0x0C, 0x0D) - 放电时间配置 (DISCHARGE_TIME, 10位)
// ----------------------------------------------------------------------------
// DISCHARGE_TIME: 设置CDC放电时间（范围: 0-1023，OLF模式: Tdischarge = (DISCHARGE_TIME + 1) × Tcycleclock，OHF模式: Tdischarge = DISCHARGE_TIME × Tcycleclock，1023表示关闭）
#define PCAP04_DISCHARGE_TIME_MAX           1023
// 寄存器12: DISCHARGE_TIME的低8位（直接输入十进制值，宏自动处理移位）
#define PCAP04_REG12_DISCHARGE_TIME_LOW_bit(val) ((uint8_t)((val) & 0xFF))
// 寄存器13: DISCHARGE_TIME的高2位（位[1:0]），同时包含其他位域
#define PCAP04_REG13_DISCHARGE_TIME_HIGH_bit(val) ((uint8_t)(((val) >> 8) & 0x03))
// 寄存器13中DISCHARGE_TIME的掩码（用于合并其他位域）
#define PCAP04_DISCHARGE_TIME_MASK_REG13    (0x03 << 0)  // 位[1:0]

// 寄存器13的其他位域（与DISCHARGE_TIME共享）
// 位[7:6] C_STARTONPIN: 选择允许触发CDC启动的GPIO端口
#define PCAP04_REG13_C_STARTONPIN_SHIFT     6
#define PCAP04_REG13_C_STARTONPIN_MASK      (0x03 << PCAP04_REG13_C_STARTONPIN_SHIFT)
#define PCAP04_REG13_C_STARTONPIN_bit(val)  (((val) & 0x03) << PCAP04_REG13_C_STARTONPIN_SHIFT)
#define PCAP04_REG13_C_STARTONPIN_PG0       0x00  // PG0
#define PCAP04_REG13_C_STARTONPIN_PG1       0x01  // PG1
#define PCAP04_REG13_C_STARTONPIN_PG2       0x02  // PG2
#define PCAP04_REG13_C_STARTONPIN_PG3       0x03  // PG3

// 位[4:2] C_TRIG_SEL: CDC触发模式选择（PCAP04每次测量包括CDC测量、RDC测量和DSP转换三个过程，一次测量并转换完成后，系统会产生一个下降沿信号INTN，这时表示转换完成并可以读取数据了，那么下一次何时转换取决于C_TRIG_SEL的配置：连续模式=一次转换结束后马上进行下一次转换；读取触发=转换完成后等待用户读取结果寄存器后进行下次转换；时间触发=每到设定转换时间系统就会做一次转换；操作码或外部触发=系统接收到转换指令后才开始转换）
#define PCAP04_REG13_C_TRIG_SEL_SHIFT       2
#define PCAP04_REG13_C_TRIG_SEL_MASK        (0x07 << PCAP04_REG13_C_TRIG_SEL_SHIFT)
#define PCAP04_REG13_C_TRIG_SEL_bit(val)    (((val) & 0x07) << PCAP04_REG13_C_TRIG_SEL_SHIFT)
#define PCAP04_REG13_C_TRIG_SEL_CONTINUOUS   0x00  // 连续模式（不推荐使用）
#define PCAP04_REG13_C_TRIG_SEL_READ_TRIGGER 0x01  // 读取触发
#define PCAP04_REG13_C_TRIG_SEL_TIMER_TRIGGER 0x02  // 定时器触发 (推荐)
#define PCAP04_REG13_C_TRIG_SEL_TIMER_STRETCH 0x03  // 定时器触发 (拉伸模式)
#define PCAP04_REG13_C_TRIG_SEL_UNDEFINED    0x04  // 未定义
#define PCAP04_REG13_C_TRIG_SEL_PIN_TRIGGER  0x05  // 引脚触发 (硬件触发)
#define PCAP04_REG13_C_TRIG_SEL_OPCODE_TRIGGER 0x06  // 操作码触发
#define PCAP04_REG13_C_TRIG_SEL_CONTINUOUS_EXT 0x07  // continuous_exp (不推荐)

