yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 寄存器13完整值构建宏（包含DISCHARGE_TIME高2位、C_STARTONPIN和C_TRIG_SEL）
// 注意：discharge_time_high可以是完整的DISCHARGE_TIME值（0-1023），宏会自动提取高2位
#define PCAP04_REG13_VALUE(discharge_time_high, startonpin, trig_sel) \
    (PCAP04_REG13_DISCHARGE_TIME_HIGH_bit(discharge_time_high) | \
     PCAP04_REG13_C_STARTONPIN_bit(startonpin) | PCAP04_REG13_C_TRIG_SEL_bit(trig_sel))

// ----------------------------------------------------------------------------
// 寄存器 14-15 (0x0E, 0x0F) - 预充电时间配置 (PRECHARGE_TIME, 10位)
// ----------------------------------------------------------------------------
// PRECHARGE_TIME: 设置CDC预充电时间（范围: 0-1023，寄存器14配置电容的预充电时间，其实我们可以选择是否需要预充电，按官方手册的说法，预充就是先快速将电容充电到某一个电压水平，然后再改变充电速度，缓慢充电到峰值水平，这样可以减小机械应力，同时还可以用来检测电容是否存在短路，1023表示关闭）
#define PCAP04_PRECHARGE_TIME_MAX           1023
// 寄存器14: PRECHARGE_TIME的低8位（直接输入十进制值，宏自动处理移位）
#define PCAP04_REG14_PRECHARGE_TIME_LOW_bit(val) ((uint8_t)((val) & 0xFF))
// 寄存器15: PRECHARGE_TIME的高2位（位[1:0]），同时包含C_FAKE位域
#define PCAP04_REG15_PRECHARGE_TIME_HIGH_bit(val) ((uint8_t)(((val) >> 8) & 0x03))
// 寄存器15中PRECHARGE_TIME的掩码（用于合并其他位域）
#define PCAP04_PRECHARGE_TIME_MASK_REG15    (0x03 << 0)  // 位[1:0]

// 寄存器15的其他位域（与PRECHARGE_TIME共享）
// 位[5:2] C_FAKE: CDC的"假"或"预热"测量数量（寄存器15用于配置伪测量次数，也就是再正式测量之前先做几次伪测量，但这几次的测量值并不会被用于真实测量值，这个根据需要配置，一般配置2-3个就可以了，不配置影响也不大，可以将寄存器7-8中的采样次数稍微增大一些，也可以减小数据的波动或测量未稳定时的干扰）
#define PCAP04_REG15_C_FAKE_SHIFT           2
#define PCAP04_REG15_C_FAKE_MASK            (0x0F << PCAP04_REG15_C_FAKE_SHIFT)
#define PCAP04_REG15_C_FAKE_bit(val)        (((val) & 0x0F) << PCAP04_REG15_C_FAKE_SHIFT)
// C_FAKE范围: 0-15（0=无假测量，1=1次假测量，...，15=15次假测量）

// 寄存器15完整值构建宏（包含PRECHARGE_TIME高2位和C_FAKE）
// 注意：precharge_time_high可以是完整的PRECHARGE_TIME值（0-1023），宏会自动提取高2位
#define PCAP04_REG15_VALUE(precharge_time_high, c_fake) \
    (PCAP04_REG15_PRECHARGE_TIME_HIGH_bit(precharge_time_high) | PCAP04_REG15_C_FAKE_bit(c_fake))

// ----------------------------------------------------------------------------
// 寄存器 16-17 (0x10, 0x11) - 满充电时间配置 (FULLCHARGE_TIME, 10位)
// ----------------------------------------------------------------------------
// FULLCHARGE_TIME: 设置CDC满充电时间（范围: 0-1023，寄存器16用于配置完全充电时的周期数，也就是充满电后持续的时间，这个根据需要设置即可，OLF模式: Tfullcharge = (FULLCHARGE_TIME + 1) × Tcycleclock，OHF模式: Tfullcharge = (FULLCHARGE_TIME + 2) × Tcycleclock）
#define PCAP04_FULLCHARGE_TIME_MAX          1023
// 寄存器16: FULLCHARGE_TIME的低8位（直接输入十进制值，宏自动处理移位）
#define PCAP04_REG16_FULLCHARGE_TIME_LOW_bit(val) ((uint8_t)((val) & 0xFF))
// 寄存器17: FULLCHARGE_TIME的高2位（位[1:0]），同时包含C_REF_SEL位域
#define PCAP04_REG17_FULLCHARGE_TIME_HIGH_bit(val) ((uint8_t)(((val) >> 8) & 0x03))
// 寄存器17中FULLCHARGE_TIME的掩码（用于合并其他位域）
#define PCAP04_FULLCHARGE_TIME_MASK_REG17    (0x03 << 0)  // 位[1:0]

// 寄存器17的其他位域（与FULLCHARGE_TIME共享）
// 位[6:2] C_REF_SEL: 设置片上参考电容（范围: 0-31，0=最小值，1=约1 pF，...，31=最大值约31 pF，注意: 步长从0.3 pF到1.5 pF不等）
#define PCAP04_REG17_C_REF_SEL_SHIFT        2
#define PCAP04_REG17_C_REF_SEL_MASK         (0x1F << PCAP04_REG17_C_REF_SEL_SHIFT)
#define PCAP04_REG17_C_REF_SEL_bit(val)     (((val) & 0x1F) << PCAP04_REG17_C_REF_SEL_SHIFT)
#define PCAP04_REG17_C_REF_SEL_MIN           0   // 最小值
#define PCAP04_REG17_C_REF_SEL_MAX           31  // 最大值 (约31 pF)

// 寄存器17完整值构建宏（包含FULLCHARGE_TIME高2位和C_REF_SEL）
// 注意：fullcharge_time_high可以是完整的FULLCHARGE_TIME值（0-1023），宏会自动提取高2位
#define PCAP04_REG17_VALUE(fullcharge_time_high, c_ref_sel) \
    (PCAP04_REG17_FULLCHARGE_TIME_HIGH_bit(fullcharge_time_high) | PCAP04_REG17_C_REF_SEL_bit(c_ref_sel))

// ----------------------------------------------------------------------------
// 寄存器 18 (0x12) - 保护驱动配置
// ----------------------------------------------------------------------------
// 位[7] C_G_OP_RUN: 保护运算放大器模式
#define PCAP04_REG18_C_G_OP_RUN_SHIFT       7
#define PCAP04_REG18_C_G_OP_RUN_MASK       (0x01 << PCAP04_REG18_C_G_OP_RUN_SHIFT)
#define PCAP04_REG18_C_G_OP_RUN_bit(val)   (((val) & 0x01) << PCAP04_REG18_C_G_OP_RUN_SHIFT)
#define PCAP04_REG18_C_G_OP_RUN_PERMANENT  0  // 永久 (默认)
#define PCAP04_REG18_C_G_OP_RUN_PULSED     1  // 脉冲（在转换之间将OP设置为睡眠模式）

// 位[6] C_G_OP_EXT: 保护外部运算放大器
#define PCAP04_REG18_C_G_OP_EXT_SHIFT      6
#define PCAP04_REG18_C_G_OP_EXT_MASK      (0x01 << PCAP04_REG18_C_G_OP_EXT_SHIFT)
#define PCAP04_REG18_C_G_OP_EXT_bit(val)  (((val) & 0x01) << PCAP04_REG18_C_G_OP_EXT_SHIFT)
#define PCAP04_REG18_C_G_OP_EXT_INTERNAL   0  // 内部OP (默认)
#define PCAP04_REG18_C_G_OP_EXT_EXTERNAL   1  // 外部OP，PG3作为C_G_MUX_SEL

// 位[5:0] C_G_EN: 保护使能，每位对应一个端口
#define PCAP04_REG18_C_G_EN_SHIFT          0
#define PCAP04_REG18_C_G_EN_MASK           (0x3F << PCAP04_REG18_C_G_EN_SHIFT)
#define PCAP04_REG18_C_G_EN_bit(val)       (((val) & 0x3F) << PCAP04_REG18_C_G_EN_SHIFT)
// C_G_EN端口使能位掩码
#define PCAP04_REG18_C_G_EN_PC0            (1 << 0)  // 激活端口PC0
#define PCAP04_REG18_C_G_EN_PC1            (1 << 1)  // 激活端口PC1
#define PCAP04_REG18_C_G_EN_PC2            (1 << 2)  // 激活端口PC2
#define PCAP04_REG18_C_G_EN_PC3            (1 << 3)  // 激活端口PC3
#define PCAP04_REG18_C_G_EN_PC4            (1 << 4)  // 激活端口PC4
#define PCAP04_REG18_C_G_EN_PC5            (1 << 5)  // 激活端口PC5
#define PCAP04_REG18_C_G_EN_NONE           0x00      // 保护功能未启用 (默认)

// 寄存器18完整值构建宏
#define PCAP04_REG18_VALUE(c_g_op_run, c_g_op_ext, c_g_en) \
    (PCAP04_REG18_C_G_OP_RUN_bit(c_g_op_run) | PCAP04_REG18_C_G_OP_EXT_bit(c_g_op_ext) | \
     PCAP04_REG18_C_G_EN_bit(c_g_en))

// ----------------------------------------------------------------------------
// 寄存器 19 (0x13) - 保护运算放大器配置
// ----------------------------------------------------------------------------
// 位[7:6] C_G_OP_VU: 保护运算放大器增益（从感测端口到保护）
#define PCAP04_REG19_C_G_OP_VU_SHIFT        6
#define PCAP04_REG19_C_G_OP_VU_MASK         (0x03 << PCAP04_REG19_C_G_OP_VU_SHIFT)
#define PCAP04_REG19_C_G_OP_VU_bit(val)     (((val) & 0x03) << PCAP04_REG19_C_G_OP_VU_SHIFT)
#define PCAP04_REG19_C_G_OP_VU_1_00         0  // × 1.00 (默认)
#define PCAP04_REG19_C_G_OP_VU_1_01         1  // × 1.01
#define PCAP04_REG19_C_G_OP_VU_1_02         2  // × 1.02
#define PCAP04_REG19_C_G_OP_VU_1_03         3  // × 1.03

