yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 位[5:4] C_G_OP_ATTN: 保护运算放大器衰减
#define PCAP04_REG19_C_G_OP_ATTN_SHIFT      4
#define PCAP04_REG19_C_G_OP_ATTN_MASK       (0x03 << PCAP04_REG19_C_G_OP_ATTN_SHIFT)
#define PCAP04_REG19_C_G_OP_ATTN_bit(val)   (((val) & 0x03) << PCAP04_REG19_C_G_OP_ATTN_SHIFT)
#define PCAP04_REG19_C_G_OP_ATTN_0_5_AF     0  // 0.5 aF (默认)
#define PCAP04_REG19_C_G_OP_ATTN_1_0_AF     1  // 1.0 aF
#define PCAP04_REG19_C_G_OP_ATTN_1_5_AF     2  // 1.5 aF
#define PCAP04_REG19_C_G_OP_ATTN_2_0_AF     3  // 2.0 aF

// 位[3:0] C_G_TIME: 保护端口切换时间（在预充电期间将保护端口从"直接连接"切换到OP的时间）
#define PCAP04_REG19_C_G_TIME_SHIFT         0
#define PCAP04_REG19_C_G_TIME_MASK          (0x0F << PCAP04_REG19_C_G_TIME_SHIFT)
#define PCAP04_REG19_C_G_TIME_bit(val)      (((val) & 0x0F) << PCAP04_REG19_C_G_TIME_SHIFT)
// C_G_TIME范围: 0-15（t = C_G_TIME × 500 ns，默认值为0）

// 寄存器19完整值构建宏
#define PCAP04_REG19_VALUE(c_g_op_vu, c_g_op_attn, c_g_time) \
    (PCAP04_REG19_C_G_OP_VU_bit(c_g_op_vu) | PCAP04_REG19_C_G_OP_ATTN_bit(c_g_op_attn) | \
     PCAP04_REG19_C_G_TIME_bit(c_g_time))

// --- RDC配置相关 (寄存器 20-39) ---

// ----------------------------------------------------------------------------
// 寄存器 20 (0x14) - RDC时间配置
// ----------------------------------------------------------------------------
// 位[7] R_CY: RDC测定的循环时间（取决于OLF频率）
// OLF频率 | R_CY=0 | R_CY=1
// 10 kHz  | 100 μs | 200 μs
// 50 kHz  | 20 μs  | 40 μs
// 100 kHz | 10 μs  | 20 μs
// 200 kHz | 20 μs  | 40 μs
#define PCAP04_REG20_R_CY_SHIFT             7
#define PCAP04_REG20_R_CY_MASK              (0x01 << PCAP04_REG20_R_CY_SHIFT)
#define PCAP04_REG20_R_CY_bit(val)          (((val) & 0x01) << PCAP04_REG20_R_CY_SHIFT)
#define PCAP04_REG20_R_CY_SHORT             0  // 较短循环时间 (默认)
#define PCAP04_REG20_R_CY_LONG             1  // 较长循环时间

// 位[2:0] C_G_OP_TR: 保护运算放大器电流调整
#define PCAP04_REG20_C_G_OP_TR_SHIFT        0
#define PCAP04_REG20_C_G_OP_TR_MASK         (0x07 << PCAP04_REG20_C_G_OP_TR_SHIFT)
#define PCAP04_REG20_C_G_OP_TR_bit(val)     (((val) & 0x07) << PCAP04_REG20_C_G_OP_TR_SHIFT)
// C_G_OP_TR范围: 0-7（推荐值，默认值为0）

// 寄存器20完整值构建宏
#define PCAP04_REG20_VALUE(r_cy, c_g_op_tr) \
    (PCAP04_REG20_R_CY_bit(r_cy) | PCAP04_REG20_C_G_OP_TR_bit(c_g_op_tr))

// ----------------------------------------------------------------------------
// 寄存器 21-22 (0x15, 0x16) - RDC预分频配置 (R_TRIG_PREDIV, 10位)
// ----------------------------------------------------------------------------
// R_TRIG_PREDIV: 预分频器（范围: 0-1023，允许温度测量比电容测量慢，这是CDC与RDC测量速率之间的因子，如果OLF用作触发源，也用作OLF时钟分频器，0/1=每次信号触发，2=每2次信号触发，...，1023=最大因子）
#define PCAP04_R_TRIG_PREDIV_MAX            1023
// 寄存器21: R_TRIG_PREDIV的低8位（直接输入十进制值，宏自动处理移位）
#define PCAP04_REG21_R_TRIG_PREDIV_LOW_bit(val) ((uint8_t)((val) & 0xFF))
// 寄存器22: R_TRIG_PREDIV的高2位（位[1:0]），同时包含R_TRIG_SEL和R_AVRG位域
#define PCAP04_REG22_R_TRIG_PREDIV_HIGH_bit(val) ((uint8_t)(((val) >> 8) & 0x03))
// 寄存器22中R_TRIG_PREDIV的掩码（用于合并其他位域）
#define PCAP04_R_TRIG_PREDIV_MASK_REG22      (0x03 << 0)  // 位[1:0]

// 寄存器22的其他位域（与R_TRIG_PREDIV共享）
// 位[6:4] R_TRIG_SEL: RDC触发源选择
#define PCAP04_REG22_R_TRIG_SEL_SHIFT       4
#define PCAP04_REG22_R_TRIG_SEL_MASK        (0x07 << PCAP04_REG22_R_TRIG_SEL_SHIFT)
#define PCAP04_REG22_R_TRIG_SEL_bit(val)    (((val) & 0x07) << PCAP04_REG22_R_TRIG_SEL_SHIFT)
#define PCAP04_REG22_R_TRIG_SEL_DISABLE      0x00  // 关闭
#define PCAP04_REG22_R_TRIG_SEL_TIMER_TRIGGER 0x01  // 定时器触发
#define PCAP04_REG22_R_TRIG_SEL_PIN_TRIGGER  0x03  // 引脚触发
#define PCAP04_REG22_R_TRIG_SEL_CDC_ASYNC    0x05  // CDC异步 (推荐)
#define PCAP04_REG22_R_TRIG_SEL_CDC_SYNC     0x06  // CDC同步

// 位[3:2] R_AVRG: RDC测定的平均值配置
#define PCAP04_REG22_R_AVRG_SHIFT           2
#define PCAP04_REG22_R_AVRG_MASK            (0x03 << PCAP04_REG22_R_AVRG_SHIFT)
#define PCAP04_REG22_R_AVRG_bit(val)        (((val) & 0x03) << PCAP04_REG22_R_AVRG_SHIFT)
#define PCAP04_REG22_R_AVRG_NO_AVG           0x00  // 不平均
#define PCAP04_REG22_R_AVRG_4_AVG           0x01  // 4次平均
#define PCAP04_REG22_R_AVRG_8_AVG           0x02  // 8次平均
#define PCAP04_REG22_R_AVRG_16_AVG          0x03  // 16次平均

// 寄存器22完整值构建宏（包含R_TRIG_PREDIV高2位、R_AVRG和R_TRIG_SEL）
// 注意：r_trig_prediv_high可以是完整的R_TRIG_PREDIV值（0-1023），宏会自动提取高2位
#define PCAP04_REG22_VALUE(r_trig_prediv_high, r_avrg, r_trig_sel) \
    (PCAP04_REG22_R_TRIG_PREDIV_HIGH_bit(r_trig_prediv_high) | \
     PCAP04_REG22_R_AVRG_bit(r_avrg) | PCAP04_REG22_R_TRIG_SEL_bit(r_trig_sel))

// ----------------------------------------------------------------------------
// 寄存器 23 (0x17) - RDC端口与参考配置
// ----------------------------------------------------------------------------
// 位[7:6] R_PORT_EN: RDC部分的端口激活（非位操作，特殊编码）
#define PCAP04_REG23_R_PORT_EN_SHIFT        6
#define PCAP04_REG23_R_PORT_EN_MASK         (0x03 << PCAP04_REG23_R_PORT_EN_SHIFT)
#define PCAP04_REG23_R_PORT_EN_bit(val)     (((val) & 0x03) << PCAP04_REG23_R_PORT_EN_SHIFT)
#define PCAP04_REG23_R_PORT_EN_DISABLE       0x00  // 禁用
#define PCAP04_REG23_R_PORT_EN_PTOREF       0x01  // 激活端口PTOREF
#define PCAP04_REG23_R_PORT_EN_PT1          0x02  // 激活端口PT1
#define PCAP04_REG23_R_PORT_EN_PT1_PTOREF   0x03  // 激活端口PT1和PTOREF

// 位[5] R_PORT_EN_IMES: 内部铝温度传感器的端口激活
#define PCAP04_REG23_R_PORT_EN_IMES_SHIFT   5
#define PCAP04_REG23_R_PORT_EN_IMES_MASK    (0x01 << PCAP04_REG23_R_PORT_EN_IMES_SHIFT)
#define PCAP04_REG23_R_PORT_EN_IMES_bit(val) (((val) & 0x01) << PCAP04_REG23_R_PORT_EN_IMES_SHIFT)
#define PCAP04_REG23_R_PORT_EN_IMES_DISABLE  0  // 禁用
#define PCAP04_REG23_R_PORT_EN_IMES_ACTIVE  1  // 激活

// 位[4] R_PORT_EN_IREF: 内部参考电阻的端口激活
#define PCAP04_REG23_R_PORT_EN_IREF_SHIFT   4
#define PCAP04_REG23_R_PORT_EN_IREF_MASK    (0x01 << PCAP04_REG23_R_PORT_EN_IREF_SHIFT)
#define PCAP04_REG23_R_PORT_EN_IREF_bit(val) (((val) & 0x01) << PCAP04_REG23_R_PORT_EN_IREF_SHIFT)
#define PCAP04_REG23_R_PORT_EN_IREF_DISABLE  0  // 禁用
#define PCAP04_REG23_R_PORT_EN_IREF_ACTIVE   1  // 激活

// 位[2] R_FAKE: RDC的"假"或"预热"测量数量
#define PCAP04_REG23_R_FAKE_SHIFT           2
#define PCAP04_REG23_R_FAKE_MASK            (0x01 << PCAP04_REG23_R_FAKE_SHIFT)
#define PCAP04_REG23_R_FAKE_bit(val)        (((val) & 0x01) << PCAP04_REG23_R_FAKE_SHIFT)
#define PCAP04_REG23_R_FAKE_2_CYCLES         0  // 每次平均有2次假测量周期
#define PCAP04_REG23_R_FAKE_8_CYCLES         1  // 每次平均有8次假测量周期

// 位[1:0] R_STARTONPIN: 选择允许触发RDC启动的GPIO端口
#define PCAP04_REG23_R_STARTONPIN_SHIFT     0
#define PCAP04_REG23_R_STARTONPIN_MASK      (0x03 << PCAP04_REG23_R_STARTONPIN_SHIFT)
#define PCAP04_REG23_R_STARTONPIN_bit(val)  (((val) & 0x03) << PCAP04_REG23_R_STARTONPIN_SHIFT)
#define PCAP04_REG23_R_STARTONPIN_PG0       0x00  // PG0
#define PCAP04_REG23_R_STARTONPIN_PG1       0x01  // PG1
#define PCAP04_REG23_R_STARTONPIN_PG2       0x02  // PG2
#define PCAP04_REG23_R_STARTONPIN_PG3       0x03  // PG3

// 寄存器23完整值构建宏
#define PCAP04_REG23_VALUE(r_port_en, r_port_en_imes, r_port_en_iref, r_fake, r_startonpin) \
    (PCAP04_REG23_R_PORT_EN_bit(r_port_en) | PCAP04_REG23_R_PORT_EN_IMES_bit(r_port_en_imes) | \
     PCAP04_REG23_R_PORT_EN_IREF_bit(r_port_en_iref) | PCAP04_REG23_R_FAKE_bit(r_fake) | \
     PCAP04_REG23_R_STARTONPIN_bit(r_startonpin))

// ----------------------------------------------------------------------------
// 寄存器 24 (0x18) - TDC配置 (ams内部固定配置 - 禁止修改)
// ----------------------------------------------------------------------------
// 位[5:4] TDC_CHAN_EN: 必须为3
#define PCAP04_REG24_TDC_CHAN_EN_SHIFT      4
#define PCAP04_REG24_TDC_CHAN_EN_MASK       (0x03 << PCAP04_REG24_TDC_CHAN_EN_SHIFT)
#define PCAP04_REG24_TDC_CHAN_EN_bit(val)   (((val) & 0x03) << PCAP04_REG24_TDC_CHAN_EN_SHIFT)
#define PCAP04_REG24_TDC_CHAN_EN_MUST_BE_3   3   // 必须为3

// 位[3] TDC_ALUPERMOPEN: 必须为0
#define PCAP04_REG24_TDC_ALUPERMOPEN_SHIFT  3
#define PCAP04_REG24_TDC_ALUPERMOPEN_MASK   (0x01 << PCAP04_REG24_TDC_ALUPERMOPEN_SHIFT)
#define PCAP04_REG24_TDC_ALUPERMOPEN_bit(val) (((val) & 0x01) << PCAP04_REG24_TDC_ALUPERMOPEN_SHIFT)
#define PCAP04_REG24_TDC_ALUPERMOPEN_MUST_BE_0  0   // 必须为0

// 位[2] TDC_NOISE_DIS: 必须为0
#define PCAP04_REG24_TDC_NOISE_DIS_SHIFT    2
#define PCAP04_REG24_TDC_NOISE_DIS_MASK     (0x01 << PCAP04_REG24_TDC_NOISE_DIS_SHIFT)
#define PCAP04_REG24_TDC_NOISE_DIS_bit(val) (((val) & 0x01) << PCAP04_REG24_TDC_NOISE_DIS_SHIFT)
#define PCAP04_REG24_TDC_NOISE_DIS_MUST_BE_0  0   // 必须为0

// 位[1:0] TDC_MUPU_SPEED: 必须为3
#define PCAP04_REG24_TDC_MUPU_SPEED_SHIFT   0
#define PCAP04_REG24_TDC_MUPU_SPEED_MASK    (0x03 << PCAP04_REG24_TDC_MUPU_SPEED_SHIFT)
#define PCAP04_REG24_TDC_MUPU_SPEED_bit(val) (((val) & 0x03) << PCAP04_REG24_TDC_MUPU_SPEED_SHIFT)
#define PCAP04_REG24_TDC_MUPU_SPEED_MUST_BE_3  3   // 必须为3

// 寄存器24完整值构建宏（推荐默认值: 0x73）
#define PCAP04_REG24_VALUE(tdc_chan_en, tdc_alupermopen, tdc_noise_dis, tdc_mupu_speed) \
    (PCAP04_REG24_TDC_CHAN_EN_bit(tdc_chan_en) | PCAP04_REG24_TDC_ALUPERMOPEN_bit(tdc_alupermopen) | \
     PCAP04_REG24_TDC_NOISE_DIS_bit(tdc_noise_dis) | PCAP04_REG24_TDC_MUPU_SPEED_bit(tdc_mupu_speed))
#define PCAP04_TDC_REG24_DEFAULT    PCAP04_REG24_VALUE(3, 0, 0, 3)  // 0x73

// ----------------------------------------------------------------------------
// 寄存器 25 (0x19) - TDC配置 (ams内部固定配置 - 禁止修改)
// ----------------------------------------------------------------------------
// 位[7:2] TDC_MUPU_NO: 必须为1
#define PCAP04_REG25_TDC_MUPU_NO_SHIFT      2
#define PCAP04_REG25_TDC_MUPU_NO_MASK      (0x3F << PCAP04_REG25_TDC_MUPU_NO_SHIFT)
#define PCAP04_REG25_TDC_MUPU_NO_bit(val)  (((val) & 0x3F) << PCAP04_REG25_TDC_MUPU_NO_SHIFT)
#define PCAP04_REG25_TDC_MUPU_NO_MUST_BE_1   1   // 必须为1

// 寄存器25完整值构建宏（推荐默认值: 0x04）
#define PCAP04_REG25_VALUE(tdc_mupu_no) \
    (PCAP04_REG25_TDC_MUPU_NO_bit(tdc_mupu_no))
#define PCAP04_TDC_REG25_DEFAULT    PCAP04_REG25_VALUE(1)  // 0x04

// ----------------------------------------------------------------------------
// 寄存器 26 (0x1A) - TDC配置 (ams内部固定配置 - 禁止修改)
// ----------------------------------------------------------------------------
// 位[7:2] TDC_QHA_SEL: 必须为20
#define PCAP04_REG26_TDC_QHA_SEL_SHIFT      2
#define PCAP04_REG26_TDC_QHA_SEL_MASK       (0x3F << PCAP04_REG26_TDC_QHA_SEL_SHIFT)
#define PCAP04_REG26_TDC_QHA_SEL_bit(val)   (((val) & 0x3F) << PCAP04_REG26_TDC_QHA_SEL_SHIFT)
#define PCAP04_REG26_TDC_QHA_SEL_MUST_BE_20  20  // 必须为20

// 位[1] TDC_NOISE_CY_DIS: 必须为1
#define PCAP04_REG26_TDC_NOISE_CY_DIS_SHIFT 1
#define PCAP04_REG26_TDC_NOISE_CY_DIS_MASK  (0x01 << PCAP04_REG26_TDC_NOISE_CY_DIS_SHIFT)
#define PCAP04_REG26_TDC_NOISE_CY_DIS_bit(val) (((val) & 0x01) << PCAP04_REG26_TDC_NOISE_CY_DIS_SHIFT)
#define PCAP04_REG26_TDC_NOISE_CY_DIS_MUST_BE_1  1   // 必须为1

// 寄存器26完整值构建宏（推荐默认值: 0x50）
#define PCAP04_REG26_VALUE(tdc_qha_sel, tdc_noise_cy_dis) \
    (PCAP04_REG26_TDC_QHA_SEL_bit(tdc_qha_sel) | PCAP04_REG26_TDC_NOISE_CY_DIS_bit(tdc_noise_cy_dis))
#define PCAP04_TDC_REG26_DEFAULT    PCAP04_REG26_VALUE(20, 1)  // 0x50

// ----------------------------------------------------------------------------
// 寄存器 27 (0x1B) - DSP配置
// ----------------------------------------------------------------------------
// 位[7:6] DSP_MOFLO_EN: 在GPIO脉冲线中启用单稳态（防抖滤波器）
#define PCAP04_REG27_DSP_MOFLO_EN_SHIFT     6
#define PCAP04_REG27_DSP_MOFLO_EN_MASK      (0x03 << PCAP04_REG27_DSP_MOFLO_EN_SHIFT)
#define PCAP04_REG27_DSP_MOFLO_EN_bit(val)  (((val) & 0x03) << PCAP04_REG27_DSP_MOFLO_EN_SHIFT)
#define PCAP04_REG27_DSP_MOFLO_EN_DISABLE    0x00  // 禁用
#define PCAP04_REG27_DSP_MOFLO_EN_ENABLE     0x03  // 启用（推荐值）

