yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 位[3:2] DSP_SPEED: DSP速度
#define PCAP04_REG27_DSP_SPEED_SHIFT        2
#define PCAP04_REG27_DSP_SPEED_MASK         (0x03 << PCAP04_REG27_DSP_SPEED_SHIFT)
#define PCAP04_REG27_DSP_SPEED_bit(val)     (((val) & 0x03) << PCAP04_REG27_DSP_SPEED_SHIFT)
#define PCAP04_REG27_DSP_SPEED_FASTEST       0x00  // 最快
#define PCAP04_REG27_DSP_SPEED_FAST          0x01  // 快
#define PCAP04_REG27_DSP_SPEED_SLOW          0x02  // 慢 (推荐)
#define PCAP04_REG27_DSP_SPEED_SLOWEST        0x03  // 最慢

// 位[1] PG1xPG3: 切换PG1/PG3到/从DSP的接线
#define PCAP04_REG27_PG1xPG3_SHIFT          1
#define PCAP04_REG27_PG1xPG3_MASK           (0x01 << PCAP04_REG27_PG1xPG3_SHIFT)
#define PCAP04_REG27_PG1xPG3_bit(val)       (((val) & 0x01) << PCAP04_REG27_PG1xPG3_SHIFT)
#define PCAP04_REG27_PG1xPG3_NORMAL          0  // 正常
#define PCAP04_REG27_PG1xPG3_SWAP            1  // 切换

// 位[0] PG0xPG2: 切换PG0/PG2到/从DSP的接线
#define PCAP04_REG27_PG0xPG2_SHIFT          0
#define PCAP04_REG27_PG0xPG2_MASK           (0x01 << PCAP04_REG27_PG0xPG2_SHIFT)
#define PCAP04_REG27_PG0xPG2_bit(val)       (((val) & 0x01) << PCAP04_REG27_PG0xPG2_SHIFT)
#define PCAP04_REG27_PG0xPG2_NORMAL          0  // 正常
#define PCAP04_REG27_PG0xPG2_SWAP            1  // 切换

// 寄存器27完整值构建宏
#define PCAP04_REG27_VALUE(dsp_moflo_en, dsp_speed, pg1xpg3, pg0xpg2) \
    (PCAP04_REG27_DSP_MOFLO_EN_bit(dsp_moflo_en) | PCAP04_REG27_DSP_SPEED_bit(dsp_speed) | \
     PCAP04_REG27_PG1xPG3_bit(pg1xpg3) | PCAP04_REG27_PG0xPG2_bit(pg0xpg2))

// ----------------------------------------------------------------------------
// 寄存器 28 (0x1C) - 看门狗配置
// ----------------------------------------------------------------------------
// 位[7:0] WD_DIS: 看门狗禁用（写入0x5A禁用看门狗，其他值启用看门狗）
#define PCAP04_REG28_WD_DIS_SHIFT           0
#define PCAP04_REG28_WD_DIS_MASK            (0xFF << PCAP04_REG28_WD_DIS_SHIFT)
#define PCAP04_REG28_WD_DIS_bit(val)       ((uint8_t)((val) & 0xFF))
#define PCAP04_REG28_WD_DIS_ENABLE          0x00  // 看门狗启用 (推荐，除0x5A外的任何值)
#define PCAP04_REG28_WD_DIS_DISABLE         0x5A  // 看门狗禁用

// ----------------------------------------------------------------------------
// 寄存器 29 (0x1D) - DSP触发配置
// ----------------------------------------------------------------------------
// 位[7:4] DSP_STARTONPIN: 启动DSP的引脚掩码（位方式PG0到PG3，每位对应一个GPIO）
#define PCAP04_REG29_DSP_STARTONPIN_SHIFT   4
#define PCAP04_REG29_DSP_STARTONPIN_MASK    (0x0F << PCAP04_REG29_DSP_STARTONPIN_SHIFT)
#define PCAP04_REG29_DSP_STARTONPIN_bit(val) (((val) & 0x0F) << PCAP04_REG29_DSP_STARTONPIN_SHIFT)
#define PCAP04_REG29_DSP_STARTONPIN_PG0     (1 << 0)  // PG0
#define PCAP04_REG29_DSP_STARTONPIN_PG1     (1 << 1)  // PG1
#define PCAP04_REG29_DSP_STARTONPIN_PG2     (1 << 2)  // PG2
#define PCAP04_REG29_DSP_STARTONPIN_PG3     (1 << 3)  // PG3

// 位[3:0] DSP_FF_IN: 触发器激活的引脚掩码（位方式DSP_IN_0到DSP_IN_3，每位对应一个DSP输入）
#define PCAP04_REG29_DSP_FF_IN_SHIFT        0
#define PCAP04_REG29_DSP_FF_IN_MASK         (0x0F << PCAP04_REG29_DSP_FF_IN_SHIFT)
#define PCAP04_REG29_DSP_FF_IN_bit(val)     (((val) & 0x0F) << PCAP04_REG29_DSP_FF_IN_SHIFT)
#define PCAP04_REG29_DSP_FF_IN_DSP_IN_0     (1 << 0)  // DSP_IN_0
#define PCAP04_REG29_DSP_FF_IN_DSP_IN_1     (1 << 1)  // DSP_IN_1
#define PCAP04_REG29_DSP_FF_IN_DSP_IN_2     (1 << 2)  // DSP_IN_2
#define PCAP04_REG29_DSP_FF_IN_DSP_IN_3     (1 << 3)  // DSP_IN_3

// 寄存器29完整值构建宏
#define PCAP04_REG29_VALUE(dsp_startonpin, dsp_ff_in) \
    (PCAP04_REG29_DSP_STARTONPIN_bit(dsp_startonpin) | PCAP04_REG29_DSP_FF_IN_bit(dsp_ff_in))

// ----------------------------------------------------------------------------
// 寄存器 30 (0x1E) - 中断配置
// ----------------------------------------------------------------------------
// 位[7] PG5_INTN_EN: 将INTN信号路由到PG5
#define PCAP04_REG30_PG5_INTN_EN_SHIFT      7
#define PCAP04_REG30_PG5_INTN_EN_MASK       (0x01 << PCAP04_REG30_PG5_INTN_EN_SHIFT)
#define PCAP04_REG30_PG5_INTN_EN_bit(val)   (((val) & 0x01) << PCAP04_REG30_PG5_INTN_EN_SHIFT)
#define PCAP04_REG30_PG5_INTN_EN_NORMAL      0  // PG5正常工作
#define PCAP04_REG30_PG5_INTN_EN_ROUTE       1  // PG5 <== INTN

// 位[6] PG4_INTN_EN: 将INTN信号路由到PG4
#define PCAP04_REG30_PG4_INTN_EN_SHIFT      6
#define PCAP04_REG30_PG4_INTN_EN_MASK       (0x01 << PCAP04_REG30_PG4_INTN_EN_SHIFT)
#define PCAP04_REG30_PG4_INTN_EN_bit(val)   (((val) & 0x01) << PCAP04_REG30_PG4_INTN_EN_SHIFT)
#define PCAP04_REG30_PG4_INTN_EN_NORMAL      0  // PG4正常工作
#define PCAP04_REG30_PG4_INTN_EN_ROUTE       1  // PG4 <== INTN

// 位[2:0] DSP_START_EN: DSP触发器启用（'bxxx1=由CDC结束触发，'bxx1x=由RDC结束触发（推荐），'bx1xx=由定时器触发）
#define PCAP04_REG30_DSP_START_EN_SHIFT     0
#define PCAP04_REG30_DSP_START_EN_MASK      (0x07 << PCAP04_REG30_DSP_START_EN_SHIFT)
#define PCAP04_REG30_DSP_START_EN_bit(val)  (((val) & 0x07) << PCAP04_REG30_DSP_START_EN_SHIFT)
#define PCAP04_REG30_DSP_START_EN_CDC_END    (1 << 0)  // 由CDC结束触发
#define PCAP04_REG30_DSP_START_EN_RDC_END    (1 << 1)  // 由RDC结束触发 (推荐)
#define PCAP04_REG30_DSP_START_EN_TIMER      (1 << 2)  // 由定时器触发

// 寄存器30完整值构建宏
#define PCAP04_REG30_VALUE(pg5_intn_en, pg4_intn_en, dsp_start_en) \
    (PCAP04_REG30_PG5_INTN_EN_bit(pg5_intn_en) | PCAP04_REG30_PG4_INTN_EN_bit(pg4_intn_en) | \
     PCAP04_REG30_DSP_START_EN_bit(dsp_start_en))

// ----------------------------------------------------------------------------
// 寄存器 31 (0x1F) - 脉冲接口0配置
// ----------------------------------------------------------------------------
// 位[7] PI1_TOGGLE_EN: 在脉冲接口1输出激活切换触发器
#define PCAP04_REG31_PI1_TOGGLE_EN_SHIFT    7
#define PCAP04_REG31_PI1_TOGGLE_EN_MASK     (0x01 << PCAP04_REG31_PI1_TOGGLE_EN_SHIFT)
#define PCAP04_REG31_PI1_TOGGLE_EN_bit(val) (((val) & 0x01) << PCAP04_REG31_PI1_TOGGLE_EN_SHIFT)
#define PCAP04_REG31_PI1_TOGGLE_EN_NORMAL    0  // 正常工作
#define PCAP04_REG31_PI1_TOGGLE_EN_TOGGLE    1  // 切换触发器激活（特别适用于PDM以创建1:1占空比）

// 位[6] PIO_TOGGLE_EN: 在脉冲接口0输出激活切换触发器
#define PCAP04_REG31_PIO_TOGGLE_EN_SHIFT    6
#define PCAP04_REG31_PIO_TOGGLE_EN_MASK     (0x01 << PCAP04_REG31_PIO_TOGGLE_EN_SHIFT)
#define PCAP04_REG31_PIO_TOGGLE_EN_bit(val) (((val) & 0x01) << PCAP04_REG31_PIO_TOGGLE_EN_SHIFT)
#define PCAP04_REG31_PIO_TOGGLE_EN_NORMAL    0  // 正常工作
#define PCAP04_REG31_PIO_TOGGLE_EN_TOGGLE    1  // 切换触发器激活（特别适用于PDM以创建1:1占空比）

