yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 位[5:4] PIO_RES: 脉冲编码接口0的分辨率
#define PCAP04_REG31_PIO_RES_SHIFT          4
#define PCAP04_REG31_PIO_RES_MASK           (0x03 << PCAP04_REG31_PIO_RES_SHIFT)
#define PCAP04_REG31_PIO_RES_bit(val)       (((val) & 0x03) << PCAP04_REG31_PIO_RES_SHIFT)
#define PCAP04_REG31_PIO_RES_10BIT          0x00  // 10位
#define PCAP04_REG31_PIO_RES_12BIT          0x01  // 12位
#define PCAP04_REG31_PIO_RES_14BIT          0x02  // 14位
#define PCAP04_REG31_PIO_RES_16BIT          0x03  // 16位

// 位[3] PIO_PDM_SEL: 脉冲接口0 PWM / PDM开关
#define PCAP04_REG31_PIO_PDM_SEL_SHIFT      3
#define PCAP04_REG31_PIO_PDM_SEL_MASK       (0x01 << PCAP04_REG31_PIO_PDM_SEL_SHIFT)
#define PCAP04_REG31_PIO_PDM_SEL_bit(val)   (((val) & 0x01) << PCAP04_REG31_PIO_PDM_SEL_SHIFT)
#define PCAP04_REG31_PIO_PDM_SEL_PWM        0  // PWM
#define PCAP04_REG31_PIO_PDM_SEL_PDM        1  // PDM

// 位[2:0] PIO_CLK_SEL: 脉冲接口0时钟选择
#define PCAP04_REG31_PIO_CLK_SEL_SHIFT      0
#define PCAP04_REG31_PIO_CLK_SEL_MASK       (0x07 << PCAP04_REG31_PIO_CLK_SEL_SHIFT)
#define PCAP04_REG31_PIO_CLK_SEL_bit(val)   (((val) & 0x07) << PCAP04_REG31_PIO_CLK_SEL_SHIFT)
#define PCAP04_REG31_PIO_CLK_SEL_OFF         0x00  // 关闭
#define PCAP04_REG31_PIO_CLK_SEL_OLF_DIV1   0x01  // OLF / 1
#define PCAP04_REG31_PIO_CLK_SEL_OLF_DIV2   0x02  // OLF / 2
#define PCAP04_REG31_PIO_CLK_SEL_OLF_DIV4   0x03  // OLF / 4
#define PCAP04_REG31_PIO_CLK_SEL_OX_DIV1    0x04  // OX / 1
#define PCAP04_REG31_PIO_CLK_SEL_OX_DIV2    0x05  // OX / 2
#define PCAP04_REG31_PIO_CLK_SEL_OX_DIV4    0x06  // OX / 4
#define PCAP04_REG31_PIO_CLK_SEL_UNDEFINED   0x07  // 未定义

// 寄存器31完整值构建宏
#define PCAP04_REG31_VALUE(pi1_toggle_en, pio_toggle_en, pio_res, pio_pdm_sel, pio_clk_sel) \
    (PCAP04_REG31_PI1_TOGGLE_EN_bit(pi1_toggle_en) | PCAP04_REG31_PIO_TOGGLE_EN_bit(pio_toggle_en) | \
     PCAP04_REG31_PIO_RES_bit(pio_res) | PCAP04_REG31_PIO_PDM_SEL_bit(pio_pdm_sel) | \
     PCAP04_REG31_PIO_CLK_SEL_bit(pio_clk_sel))

// ----------------------------------------------------------------------------
// 寄存器 32 (0x20) - 脉冲接口1配置
// ----------------------------------------------------------------------------
// 位[5:4] PI1_RES: 脉冲接口1的分辨率
#define PCAP04_REG32_PI1_RES_SHIFT          4
#define PCAP04_REG32_PI1_RES_MASK           (0x03 << PCAP04_REG32_PI1_RES_SHIFT)
#define PCAP04_REG32_PI1_RES_bit(val)       (((val) & 0x03) << PCAP04_REG32_PI1_RES_SHIFT)
#define PCAP04_REG32_PI1_RES_10BIT          0x00  // 10位
#define PCAP04_REG32_PI1_RES_12BIT          0x01  // 12位
#define PCAP04_REG32_PI1_RES_14BIT          0x02  // 14位
#define PCAP04_REG32_PI1_RES_16BIT          0x03  // 16位

// 位[3] PI1_PDM_SEL: 脉冲接口1 PWM / PDM开关
#define PCAP04_REG32_PI1_PDM_SEL_SHIFT      3
#define PCAP04_REG32_PI1_PDM_SEL_MASK       (0x01 << PCAP04_REG32_PI1_PDM_SEL_SHIFT)
#define PCAP04_REG32_PI1_PDM_SEL_bit(val)   (((val) & 0x01) << PCAP04_REG32_PI1_PDM_SEL_SHIFT)
#define PCAP04_REG32_PI1_PDM_SEL_PWM        0  // PWM
#define PCAP04_REG32_PI1_PDM_SEL_PDM        1  // PDM

// 位[2:0] PI1_CLK_SEL: 脉冲接口1时钟选择
#define PCAP04_REG32_PI1_CLK_SEL_SHIFT      0
#define PCAP04_REG32_PI1_CLK_SEL_MASK       (0x07 << PCAP04_REG32_PI1_CLK_SEL_SHIFT)
#define PCAP04_REG32_PI1_CLK_SEL_bit(val)   (((val) & 0x07) << PCAP04_REG32_PI1_CLK_SEL_SHIFT)
#define PCAP04_REG32_PI1_CLK_SEL_OFF         0x00  // 关闭
#define PCAP04_REG32_PI1_CLK_SEL_OLF_DIV1   0x01  // OLF / 1
#define PCAP04_REG32_PI1_CLK_SEL_OLF_DIV2   0x02  // OLF / 2
#define PCAP04_REG32_PI1_CLK_SEL_OLF_DIV4   0x03  // OLF / 4
#define PCAP04_REG32_PI1_CLK_SEL_OX_DIV1    0x04  // OX / 1
#define PCAP04_REG32_PI1_CLK_SEL_OX_DIV2    0x05  // OX / 2
#define PCAP04_REG32_PI1_CLK_SEL_OX_DIV4    0x06  // OX / 4
#define PCAP04_REG32_PI1_CLK_SEL_UNDEFINED   0x07  // 未定义

// 寄存器32完整值构建宏
#define PCAP04_REG32_VALUE(pi1_res, pi1_pdm_sel, pi1_clk_sel) \
    (PCAP04_REG32_PI1_RES_bit(pi1_res) | PCAP04_REG32_PI1_PDM_SEL_bit(pi1_pdm_sel) | \
     PCAP04_REG32_PI1_CLK_SEL_bit(pi1_clk_sel))

// ----------------------------------------------------------------------------
// 寄存器 33 (0x21) - GPIO配置
// ----------------------------------------------------------------------------
// 位[7:4] PG_DIR_IN: 通用端口方向切换（输入/输出）
//  位4: PG0方向 (0=输出, 1=输入)
//  位5: PG1方向 (0=输出, 1=输入)
//  位6: PG2方向 (0=输出, 1=输入)
//  位7: PG3方向 (0=输出, 1=输入)
#define PCAP04_REG33_PG_DIR_IN_SHIFT        4
#define PCAP04_REG33_PG_DIR_IN_MASK         (0x0F << PCAP04_REG33_PG_DIR_IN_SHIFT)
#define PCAP04_REG33_PG_DIR_IN_bit(val)     (((val) & 0x0F) << PCAP04_REG33_PG_DIR_IN_SHIFT)
// PG_DIR_IN端口方向位掩码 (0=输出, 1=输入)
#define PCAP04_REG33_PG0_DIR_OUTPUT        0  // PG0方向 = 输出 (默认)
#define PCAP04_REG33_PG0_DIR_INPUT         (1 << 0)  // PG0方向 = 输入 (位4)
#define PCAP04_REG33_PG1_DIR_OUTPUT        0  // PG1方向 = 输出 (默认)
#define PCAP04_REG33_PG1_DIR_INPUT         (1 << 1)  // PG1方向 = 输入 (位5)
#define PCAP04_REG33_PG2_DIR_OUTPUT        0  // PG2方向 = 输出 (默认)
#define PCAP04_REG33_PG2_DIR_INPUT         (1 << 2)  // PG2方向 = 输入 (位6)
#define PCAP04_REG33_PG3_DIR_OUTPUT        0  // PG3方向 = 输出 (默认)
#define PCAP04_REG33_PG3_DIR_INPUT         (1 << 3)  // PG3方向 = 输入 (位7)

// 位[3:0] PG_PU: 在通用端口激活保护上拉电阻
#define PCAP04_REG33_PG_PU_SHIFT            0
#define PCAP04_REG33_PG_PU_MASK             (0x0F << PCAP04_REG33_PG_PU_SHIFT)
#define PCAP04_REG33_PG_PU_bit(val)         (((val) & 0x0F) << PCAP04_REG33_PG_PU_SHIFT)
// PG_PU端口上拉位掩码 (0=禁用, 1=激活)
#define PCAP04_REG33_PG0_PU_DISABLE         0  // PG0上拉 = 禁用 (默认)
#define PCAP04_REG33_PG0_PU_ENABLE         (1 << 0)  // PG0上拉 = 激活
#define PCAP04_REG33_PG1_PU_DISABLE         0  // PG1上拉 = 禁用 (默认)
#define PCAP04_REG33_PG1_PU_ENABLE         (1 << 1)  // PG1上拉 = 激活
#define PCAP04_REG33_PG2_PU_DISABLE         0  // PG2上拉 = 禁用 (默认)
#define PCAP04_REG33_PG2_PU_ENABLE         (1 << 2)  // PG2上拉 = 激活
#define PCAP04_REG33_PG3_PU_DISABLE         0  // PG3上拉 = 禁用 (默认)
#define PCAP04_REG33_PG3_PU_ENABLE         (1 << 3)  // PG3上拉 = 激活

// 寄存器33完整值构建宏
// 注意：pg_dir_in和pg_pu可以是位掩码的组合（使用 | 操作符）
#define PCAP04_REG33_VALUE(pg_dir_in, pg_pu) \
    (PCAP04_REG33_PG_DIR_IN_bit(pg_dir_in) | PCAP04_REG33_PG_PU_bit(pg_pu))

// ----------------------------------------------------------------------------
// 寄存器 34 (0x22) - 带隙与自动启动配置
// ----------------------------------------------------------------------------
// 位[7] INT_TRIG_BG: 读取结束触发带隙
#define PCAP04_REG34_INT_TRIG_BG_SHIFT      7
#define PCAP04_REG34_INT_TRIG_BG_MASK       (0x01 << PCAP04_REG34_INT_TRIG_BG_SHIFT)
#define PCAP04_REG34_INT_TRIG_BG_bit(val)   (((val) & 0x01) << PCAP04_REG34_INT_TRIG_BG_SHIFT)
#define PCAP04_REG34_INT_TRIG_BG_DISABLE     0  // 禁用
#define PCAP04_REG34_INT_TRIG_BG_ENABLE      1  // 启用

// 位[6] DSP_TRIG_BG: 带隙刷新由DSP位设置触发
#define PCAP04_REG34_DSP_TRIG_BG_SHIFT      6
#define PCAP04_REG34_DSP_TRIG_BG_MASK       (0x01 << PCAP04_REG34_DSP_TRIG_BG_SHIFT)
#define PCAP04_REG34_DSP_TRIG_BG_bit(val)   (((val) & 0x01) << PCAP04_REG34_DSP_TRIG_BG_SHIFT)
#define PCAP04_REG34_DSP_TRIG_BG_DISABLE     0  // 禁用
#define PCAP04_REG34_DSP_TRIG_BG_ENABLE      1  // 启用

// 位[5] BG_PERM: 激活带隙永久启用（当BG_PERM = 1时，电流消耗增加约20 μA）
#define PCAP04_REG34_BG_PERM_SHIFT          5
#define PCAP04_REG34_BG_PERM_MASK           (0x01 << PCAP04_REG34_BG_PERM_SHIFT)
#define PCAP04_REG34_BG_PERM_bit(val)       (((val) & 0x01) << PCAP04_REG34_BG_PERM_SHIFT)
#define PCAP04_REG34_BG_PERM_PULSE_MODE      0  // 带隙脉冲模式
#define PCAP04_REG34_BG_PERM_PERMANENT       1  // 带隙永久启用

