yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// 位[4] AUTOSTART: 在上电后触发CDC（用于独立操作，在上电后触发CDC）
#define PCAP04_REG34_AUTOSTART_SHIFT        4
#define PCAP04_REG34_AUTOSTART_MASK         (0x01 << PCAP04_REG34_AUTOSTART_SHIFT)
#define PCAP04_REG34_AUTOSTART_bit(val)     (((val) & 0x01) << PCAP04_REG34_AUTOSTART_SHIFT)
#define PCAP04_REG34_AUTOSTART_DISABLE        0  // 禁用
#define PCAP04_REG34_AUTOSTART_ENABLE        1  // 启用

// 位[3:0] AMS_INTERNAL: ams内部位（必须为7）
#define PCAP04_REG34_AMS_INTERNAL_SHIFT     0
#define PCAP04_REG34_AMS_INTERNAL_MASK      (0x0F << PCAP04_REG34_AMS_INTERNAL_SHIFT)
#define PCAP04_REG34_AMS_INTERNAL_bit(val)  (((val) & 0x0F) << PCAP04_REG34_AMS_INTERNAL_SHIFT)
#define PCAP04_REG34_AMS_INTERNAL_MUST_BE_7  7   // 必须为7

// 寄存器34完整值构建宏
// 注意：AMS_INTERNAL[3:0] = 7 (必须为7，固定值，自动设置，无需用户输入)
#define PCAP04_REG34_VALUE(int_trig_bg, dsp_trig_bg, bg_perm, autostart) \
    (PCAP04_REG34_INT_TRIG_BG_bit(int_trig_bg) | PCAP04_REG34_DSP_TRIG_BG_bit(dsp_trig_bg) | \
     PCAP04_REG34_BG_PERM_bit(bg_perm) | PCAP04_REG34_AUTOSTART_bit(autostart) | \
     PCAP04_REG34_AMS_INTERNAL_bit(7))  // AMS_INTERNAL自动设置为7（固定值）

// ----------------------------------------------------------------------------
// 寄存器 35 (0x23) - 增益缩放因子 (CDC_GAIN_CORR)
// ----------------------------------------------------------------------------
// 位[7:0] CDC_GAIN_CORR: 增益校正因子（范围: 0-255，公式: 增益 = 1 + n/256）
#define PCAP04_REG35_CDC_GAIN_CORR_SHIFT    0
#define PCAP04_REG35_CDC_GAIN_CORR_MASK     (0xFF << PCAP04_REG35_CDC_GAIN_CORR_SHIFT)
#define PCAP04_REG35_CDC_GAIN_CORR_bit(val) ((uint8_t)((val) & 0xFF))
#define PCAP04_REG35_CDC_GAIN_CORR_1_00      0x00  // 增益 = 1.0
#define PCAP04_REG35_CDC_GAIN_CORR_1_125    0x20  // 增益 = 1.125 (n=32)
#define PCAP04_REG35_CDC_GAIN_CORR_1_25     0x40  // 增益 = 1.25 (n=64, 推荐)
#define PCAP04_REG35_CDC_GAIN_CORR_1_375    0x60  // 增益 = 1.375 (n=96)
#define PCAP04_REG35_CDC_GAIN_CORR_1_50     0x80  // 增益 = 1.5 (n=128)
#define PCAP04_REG35_CDC_GAIN_CORR_1_996    0xFF  // 增益 ≈ 1.996 (n=255)

// 寄存器 36 (0x24) - 未使用 (必须为0x00)
// 寄存器 37 (0x25) - 未使用 (必须为0x00)

// 寄存器 38 (0x26) - 带隙时间配置
#define PCAP04_REG38_BG_TIME_SHIFT          0  // 带隙时间 (固件定义) [7:0]
#define PCAP04_REG38_BG_TIME_MASK           (0xFF << PCAP04_REG38_BG_TIME_SHIFT)

// ----------------------------------------------------------------------------
// 寄存器 39 (0x27) - 脉冲选择配置
// ----------------------------------------------------------------------------
// 位[7:4] PULSE_SEL1: 为脉冲接口1选择源（固件定义）
#define PCAP04_REG39_PULSE_SEL1_SHIFT       4
#define PCAP04_REG39_PULSE_SEL1_MASK        (0x0F << PCAP04_REG39_PULSE_SEL1_SHIFT)
#define PCAP04_REG39_PULSE_SEL1_bit(val)    (((val) & 0x0F) << PCAP04_REG39_PULSE_SEL1_SHIFT)
#define PCAP04_REG39_PULSE_SEL1_RES0        0x00  // C0/Cref
#define PCAP04_REG39_PULSE_SEL1_RES1        0x01  // C1/Cref
#define PCAP04_REG39_PULSE_SEL1_RES2        0x02  // C2/Cref
#define PCAP04_REG39_PULSE_SEL1_RES3        0x03  // C3/Cref
#define PCAP04_REG39_PULSE_SEL1_RES4        0x04  // C4/Cref
#define PCAP04_REG39_PULSE_SEL1_RES5        0x05  // C5/Cref
#define PCAP04_REG39_PULSE_SEL1_RES6        0x06  // Res6 (PT1/Ref @PCap04_standard)
#define PCAP04_REG39_PULSE_SEL1_RES7        0x07  // Res7 (Alu/Ref @PCap04_standard)

// 位[3:0] PULSE_SEL0: 为脉冲接口0选择源（固件定义）
#define PCAP04_REG39_PULSE_SEL0_SHIFT       0
#define PCAP04_REG39_PULSE_SEL0_MASK        (0x0F << PCAP04_REG39_PULSE_SEL0_SHIFT)
#define PCAP04_REG39_PULSE_SEL0_bit(val)    (((val) & 0x0F) << PCAP04_REG39_PULSE_SEL0_SHIFT)
#define PCAP04_REG39_PULSE_SEL0_RES0        0x00  // C0/Cref
#define PCAP04_REG39_PULSE_SEL0_RES1        0x01  // C1/Cref
#define PCAP04_REG39_PULSE_SEL0_RES2        0x02  // C2/Cref
#define PCAP04_REG39_PULSE_SEL0_RES3        0x03  // C3/Cref
#define PCAP04_REG39_PULSE_SEL0_RES4        0x04  // C4/Cref
#define PCAP04_REG39_PULSE_SEL0_RES5        0x05  // C5/Cref
#define PCAP04_REG39_PULSE_SEL0_RES6        0x06  // Res6 (PT1/Ref @PCap04_standard)
#define PCAP04_REG39_PULSE_SEL0_RES7        0x07  // Res7 (Alu/Ref @PCap04_standard)

// 寄存器39完整值构建宏
#define PCAP04_REG39_VALUE(pulse_sel1, pulse_sel0) \
    (PCAP04_REG39_PULSE_SEL1_bit(pulse_sel1) | PCAP04_REG39_PULSE_SEL0_bit(pulse_sel0))

// --- 固件和DSP相关 (寄存器 40-63) ---

// 寄存器 40 (0x28) - 电容感测选择 (仅PCap04_linearize固件)
#define PCAP04_REG40_C_SENSE_SEL_SHIFT      0  // 电容比率选择 [7:0]
#define PCAP04_REG40_C_SENSE_SEL_MASK       (0xFF << PCAP04_REG40_C_SENSE_SEL_SHIFT)

// 寄存器 41 (0x29) - 电阻感测选择 (仅PCap04_linearize固件)
#define PCAP04_REG41_R_SENSE_SEL_SHIFT      0  // 电阻比率选择 [7:0]
#define PCAP04_REG41_R_SENSE_SEL_MASK       (0xFF << PCAP04_REG41_R_SENSE_SEL_SHIFT)

// ----------------------------------------------------------------------------
// 寄存器 42 (0x2A) - 固件配置与报警选择
// ----------------------------------------------------------------------------
// 位[6] ALARM1_SELECT: 报警1选择（仅PCap04_linearize固件，极性选择: 0 = Z, 1 = Theta，在PG1选择报警信号源（高电平有效））
#define PCAP04_REG42_ALARM1_SELECT_SHIFT    6
#define PCAP04_REG42_ALARM1_SELECT_MASK     (0x01 << PCAP04_REG42_ALARM1_SELECT_SHIFT)
#define PCAP04_REG42_ALARM1_SELECT_bit(val)  (((val) & 0x01) << PCAP04_REG42_ALARM1_SELECT_SHIFT)
#define PCAP04_REG42_ALARM1_SELECT_Z        0  // Z
#define PCAP04_REG42_ALARM1_SELECT_Theta    1  // Theta

// 位[4] ALARM0_SELECT: 报警0选择（仅PCap04_linearize固件，极性选择: 0 = Z, 1 = Theta，在PG0选择报警信号源（高电平有效））
#define PCAP04_REG42_ALARM0_SELECT_SHIFT    4
#define PCAP04_REG42_ALARM0_SELECT_MASK     (0x01 << PCAP04_REG42_ALARM0_SELECT_SHIFT)
#define PCAP04_REG42_ALARM0_SELECT_bit(val)  (((val) & 0x01) << PCAP04_REG42_ALARM0_SELECT_SHIFT)
#define PCAP04_REG42_ALARM0_SELECT_Z        0  // Z
#define PCAP04_REG42_ALARM0_SELECT_Theta    1  // Theta

// 位[3] EN_ASYNC_READ: 启用异步读取（结果寄存器Res0到Res7中的值仅在读取先前值后才更新）
#define PCAP04_REG42_EN_ASYNC_READ_SHIFT    3
#define PCAP04_REG42_EN_ASYNC_READ_MASK     (0x01 << PCAP04_REG42_EN_ASYNC_READ_SHIFT)
#define PCAP04_REG42_EN_ASYNC_READ_bit(val) (((val) & 0x01) << PCAP04_REG42_EN_ASYNC_READ_SHIFT)
#define PCAP04_REG42_EN_ASYNC_READ_DISABLE   0  // 禁用
#define PCAP04_REG42_EN_ASYNC_READ_ACTIVE    1  // 激活

// 位[2] HS_MODE_SEL: ams内部位（必须为0）
#define PCAP04_REG42_HS_MODE_SEL_SHIFT      2
#define PCAP04_REG42_HS_MODE_SEL_MASK       (0x01 << PCAP04_REG42_HS_MODE_SEL_SHIFT)
#define PCAP04_REG42_HS_MODE_SEL_bit(val)   (((val) & 0x01) << PCAP04_REG42_HS_MODE_SEL_SHIFT)
#define PCAP04_REG42_HS_MODE_SEL_MUST_BE_0   0   // 必须为0

// 位[1] R_MEDIAN_EN: 启用R的中值滤波器（仅PCap04_linearize固件，在线性化固件中启用ri的中值滤波器）
#define PCAP04_REG42_R_MEDIAN_EN_SHIFT      1
#define PCAP04_REG42_R_MEDIAN_EN_MASK       (0x01 << PCAP04_REG42_R_MEDIAN_EN_SHIFT)
#define PCAP04_REG42_R_MEDIAN_EN_bit(val)   (((val) & 0x01) << PCAP04_REG42_R_MEDIAN_EN_SHIFT)
#define PCAP04_REG42_R_MEDIAN_EN_DISABLE     0  // 禁用
#define PCAP04_REG42_R_MEDIAN_EN_ENABLE      1  // 启用

// 位[0] C_MEDIAN_EN: 启用C的中值滤波器（仅PCap04_linearize固件，在线性化固件中启用ci的中值滤波器）
#define PCAP04_REG42_C_MEDIAN_EN_SHIFT      0
#define PCAP04_REG42_C_MEDIAN_EN_MASK       (0x01 << PCAP04_REG42_C_MEDIAN_EN_SHIFT)
#define PCAP04_REG42_C_MEDIAN_EN_bit(val)   (((val) & 0x01) << PCAP04_REG42_C_MEDIAN_EN_SHIFT)
#define PCAP04_REG42_C_MEDIAN_EN_DISABLE     0  // 禁用
#define PCAP04_REG42_C_MEDIAN_EN_ENABLE      1  // 启用

// 寄存器42完整值构建宏
// 注意：HS_MODE_SEL[2] = 0 (必须为0，固定值，自动设置，无需用户输入)
#define PCAP04_REG42_VALUE(alarm1_select, alarm0_select, en_async_read, r_median_en, c_median_en) \
    (PCAP04_REG42_ALARM1_SELECT_bit(alarm1_select) | PCAP04_REG42_ALARM0_SELECT_bit(alarm0_select) | \
     PCAP04_REG42_EN_ASYNC_READ_bit(en_async_read) | PCAP04_REG42_HS_MODE_SEL_bit(0) | \
     PCAP04_REG42_R_MEDIAN_EN_bit(r_median_en) | PCAP04_REG42_C_MEDIAN_EN_bit(c_median_en))  // HS_MODE_SEL自动设置为0（固定值）

// ----------------------------------------------------------------------------
// 寄存器 43-46 (0x2B-0x2E) - 保留寄存器 (必须为0x00)
// ----------------------------------------------------------------------------
// 这些寄存器必须保持为0x00，禁止修改

// ----------------------------------------------------------------------------
// 寄存器 47 (0x2F) - 运行位配置
// ----------------------------------------------------------------------------
// 位[0] RUNBIT: 前端和DSP的开关
#define PCAP04_REG47_RUNBIT_SHIFT           0
#define PCAP04_REG47_RUNBIT_MASK            (0x01 << PCAP04_REG47_RUNBIT_SHIFT)
#define PCAP04_REG47_RUNBIT_bit(val)        (((val) & 0x01) << PCAP04_REG47_RUNBIT_SHIFT)
#define PCAP04_REG47_RUNBIT_OFF              0  // 关闭 = 芯片系统空闲并受保护
#define PCAP04_REG47_RUNBIT_ON               1  // 开启 = 保护被移除，系统可以运行

// ----------------------------------------------------------------------------
// 寄存器 48 (0x30) - 内存锁配置
// ----------------------------------------------------------------------------
// 位[3:0] MEM_LOCK: 数据安全功能（范围: 0-15，具体功能由固件定义）
#define PCAP04_REG48_MEM_LOCK_SHIFT         0
#define PCAP04_REG48_MEM_LOCK_MASK          (0x0F << PCAP04_REG48_MEM_LOCK_SHIFT)
#define PCAP04_REG48_MEM_LOCK_bit(val)      (((val) & 0x0F) << PCAP04_REG48_MEM_LOCK_SHIFT)

// ----------------------------------------------------------------------------
// 寄存器 49 (0x31) - 序列号低字节（只读）
// ----------------------------------------------------------------------------
// 位[7:0] SERIAL_NUMBER_L: 序列号低字节（只读寄存器）
#define PCAP04_REG49_SERIAL_NUMBER_L_SHIFT  0
#define PCAP04_REG49_SERIAL_NUMBER_L_MASK   (0xFF << PCAP04_REG49_SERIAL_NUMBER_L_SHIFT)
#define PCAP04_REG49_SERIAL_NUMBER_L_bit(val) ((uint8_t)((val) & 0xFF))

// ----------------------------------------------------------------------------
// 寄存器 50 (0x32) - 序列号高字节（只读）
// ----------------------------------------------------------------------------
// 位[7:0] SERIAL_NUMBER_H: 序列号高字节（只读寄存器）
#define PCAP04_REG50_SERIAL_NUMBER_H_SHIFT  0
#define PCAP04_REG50_SERIAL_NUMBER_H_MASK   (0xFF << PCAP04_REG50_SERIAL_NUMBER_H_SHIFT)
#define PCAP04_REG50_SERIAL_NUMBER_H_bit(val) ((uint8_t)((val) & 0xFF))

// ----------------------------------------------------------------------------
// 寄存器 51-53 (0x33-0x35) - ams内部寄存器 (必须为0x00)
// ----------------------------------------------------------------------------
// 这些寄存器必须保持为0x00，禁止修改

// ----------------------------------------------------------------------------
// 寄存器 54 (0x36) - 内存控制
// ----------------------------------------------------------------------------
// 位[7:0] MEM_CTRL: 内存控制命令
#define PCAP04_REG54_MEM_CTRL_SHIFT         0
#define PCAP04_REG54_MEM_CTRL_MASK          (0xFF << PCAP04_REG54_MEM_CTRL_SHIFT)
#define PCAP04_REG54_MEM_CTRL_bit(val)      ((uint8_t)((val) & 0xFF))
#define PCAP04_REG54_MEM_CTRL_STORE_NVRAM   0x2D  // NVRAM存储启用 (将配置存储到NVRAM)
#define PCAP04_REG54_MEM_CTRL_RECALL_NVRAM  0x59  // NVRAM召回启用 (从NVRAM重新加载配置)
#define PCAP04_REG54_MEM_CTRL_ERASE_NVRAM   0xB8  // NVRAM擦除 (擦除NVRAM)

// ----------------------------------------------------------------------------
// 寄存器 55-61 (0x37-0x3D) - ams内部寄存器 (必须为0x00)
// ----------------------------------------------------------------------------
// 这些寄存器必须保持为0x00，禁止修改

// ----------------------------------------------------------------------------
// 寄存器 62 (0x3E) - 电荷泵配置低字节 (重要: 设备特定设置，禁止更改)
// ----------------------------------------------------------------------------
// 位[7:0] CHARGE_PUMP_L: 电荷泵配置低字节（设备特定设置，禁止更改）
#define PCAP04_REG62_CHARGE_PUMP_L_SHIFT    0
#define PCAP04_REG62_CHARGE_PUMP_L_MASK     (0xFF << PCAP04_REG62_CHARGE_PUMP_L_SHIFT)
#define PCAP04_REG62_CHARGE_PUMP_L_bit(val) ((uint8_t)((val) & 0xFF))

// ----------------------------------------------------------------------------
// 寄存器 63 (0x3F) - 电荷泵配置高字节 (重要: 设备特定设置，禁止更改)
// ----------------------------------------------------------------------------
// 位[7:0] CHARGE_PUMP_H: 电荷泵配置高字节（设备特定设置，禁止更改）
#define PCAP04_REG63_CHARGE_PUMP_H_SHIFT    0
#define PCAP04_REG63_CHARGE_PUMP_H_MASK     (0xFF << PCAP04_REG63_CHARGE_PUMP_H_SHIFT)
#define PCAP04_REG63_CHARGE_PUMP_H_bit(val) ((uint8_t)((val) & 0xFF))


// --- 多字节寄存器访问宏 ---
// 这些宏用于将跨越多个寄存器的值进行组合和拆分。

// C_AVRG (寄存器 7-8, 13位)
// 从寄存器值获取C_AVRG (reg_val_8是高字节，reg_val_7是低字节)
#define PCAP04_GET_C_AVRG(reg_val_8, reg_val_7) \
    (((uint16_t)((reg_val_8) & 0x1F) << 8) | (reg_val_7))

// 设置C_AVRG的寄存器7 (低8位)
#define PCAP04_SET_C_AVRG_REG7(value) \
    ((uint8_t)((value) & 0xFF))

// 设置C_AVRG的寄存器8 (高5位)
#define PCAP04_SET_C_AVRG_REG8(value) \
    ((uint8_t)(((value) >> 8) & 0x1F))

