yuanchui/CDC_code/PCAP04电路STM32程序/usb - 副本 - 副本/PCAP04_USB/Core/Inc/pcap04_reg.h
// C_AVRG配置项生成宏（一次性设置寄存器7-8，只需输入一次值）
// 使用方式：在配置数组中展开为两个配置项
// 例如：PCAP04_C_AVRG_CONFIG(32) 会展开为两个配置项，分别设置寄存器7和8
#define PCAP04_C_AVRG_CONFIG(value) \
    {PCAP04_REG_ADDR_7, PCAP04_SET_C_AVRG_REG7(value)}, \
    {PCAP04_REG_ADDR_8, PCAP04_SET_C_AVRG_REG8(value)}

// CONV_TIME (寄存器 9-11, 23位)
// 从寄存器值获取CONV_TIME (reg_val_11是最高字节，reg_val_9是最低字节)
#define PCAP04_GET_CONV_TIME(reg_val_11, reg_val_10, reg_val_9) \
    (((uint32_t)((reg_val_11) & 0x7F) << 16) | ((uint32_t)(reg_val_10) << 8) | (reg_val_9))

// 设置CONV_TIME的寄存器9 (低8位)
#define PCAP04_SET_CONV_TIME_REG9(value) \
    ((uint8_t)((value) & 0xFF))

// 设置CONV_TIME的寄存器10 (中间8位)
#define PCAP04_SET_CONV_TIME_REG10(value) \
    ((uint8_t)(((value) >> 8) & 0xFF))

// 设置CONV_TIME的寄存器11 (高7位)
#define PCAP04_SET_CONV_TIME_REG11(value) \
    ((uint8_t)(((value) >> 16) & 0x7F))

// CONV_TIME配置项生成宏（一次性设置寄存器9-11，只需输入一次值）
// 使用方式：在配置数组中展开为三个配置项
// 例如：PCAP04_CONV_TIME_CONFIG(2000) 会展开为三个配置项，分别设置寄存器9、10、11
// 说明：CONV_TIME值会影响寄存器9[7:0]、寄存器10[7:0]、寄存器11[6:0]
#define PCAP04_CONV_TIME_CONFIG(value) \
    {PCAP04_REG_ADDR_9, PCAP04_SET_CONV_TIME_REG9(value)}, \
    {PCAP04_REG_ADDR_10, PCAP04_SET_CONV_TIME_REG10(value)}, \
    {PCAP04_REG_ADDR_11, PCAP04_SET_CONV_TIME_REG11(value)}

// DISCHARGE_TIME (寄存器 12-13, 10位)
// 从寄存器值获取DISCHARGE_TIME (reg_val_13是高2位，reg_val_12是低8位)
#define PCAP04_GET_DISCHARGE_TIME(reg_val_13, reg_val_12) \
    (((uint16_t)((reg_val_13) & 0x03) << 8) | (reg_val_12))

// 设置DISCHARGE_TIME的寄存器12 (低8位)
#define PCAP04_SET_DISCHARGE_TIME_REG12(value) \
    ((uint8_t)((value) & 0xFF))

// 设置DISCHARGE_TIME的寄存器13 (高2位，注意保留其他位域)
#define PCAP04_SET_DISCHARGE_TIME_REG13(current_reg13_val, value) \
    ((uint8_t)(((current_reg13_val) & ~PCAP04_DISCHARGE_TIME_MASK_REG13) | (((value) >> 8) & 0x03)))

// DISCHARGE_TIME配置项生成宏（一次性设置寄存器12，寄存器13需要与其他位域合并）
// 使用方式：在配置数组中展开为一个配置项（寄存器12）
// 说明：DISCHARGE_TIME值会影响寄存器12[7:0]（低8位）和寄存器13[1:0]（高2位）
// 注意：寄存器13还包含C_STARTONPIN[7:6]和C_TRIG_SEL[4:2]，需要使用PCAP04_REG13_VALUE合并
#define PCAP04_DISCHARGE_TIME_CONFIG(value) \
    {PCAP04_REG_ADDR_12, PCAP04_SET_DISCHARGE_TIME_REG12(value)}

// DISCHARGE_TIME和寄存器13组合配置宏（一次性设置寄存器12和13，只需输入一次DISCHARGE_TIME值）
// 使用方式：在配置数组中展开为两个配置项（寄存器12和13）
// 说明：DISCHARGE_TIME值会自动设置到寄存器12[7:0]和寄存器13[1:0]，同时设置C_STARTONPIN和C_TRIG_SEL
#define PCAP04_DISCHARGE_TIME_AND_REG13_CONFIG(discharge_time, startonpin, trig_sel) \
    {PCAP04_REG_ADDR_12, PCAP04_SET_DISCHARGE_TIME_REG12(discharge_time)}, \
    {PCAP04_REG_ADDR_13, PCAP04_REG13_VALUE(discharge_time, startonpin, trig_sel)}

// PRECHARGE_TIME (寄存器 14-15, 10位)
// 从寄存器值获取PRECHARGE_TIME (reg_val_15是高2位，reg_val_14是低8位)
#define PCAP04_GET_PRECHARGE_TIME(reg_val_15, reg_val_14) \
    (((uint16_t)((reg_val_15) & 0x03) << 8) | (reg_val_14))

// 设置PRECHARGE_TIME的寄存器14 (低8位)
#define PCAP04_SET_PRECHARGE_TIME_REG14(value) \
    ((uint8_t)((value) & 0xFF))

// 设置PRECHARGE_TIME的寄存器15 (高2位，注意保留其他位域)
#define PCAP04_SET_PRECHARGE_TIME_REG15(current_reg15_val, value) \
    ((uint8_t)(((current_reg15_val) & ~PCAP04_PRECHARGE_TIME_MASK_REG15) | (((value) >> 8) & 0x03)))

// PRECHARGE_TIME配置项生成宏（一次性设置寄存器14，寄存器15需要与其他位域合并）
// 使用方式：在配置数组中展开为一个配置项（寄存器14）
// 说明：PRECHARGE_TIME值会影响寄存器14[7:0]（低8位）和寄存器15[1:0]（高2位）
// 注意：寄存器15还包含C_FAKE[5:2]，需要使用PCAP04_REG15_VALUE合并
#define PCAP04_PRECHARGE_TIME_CONFIG(value) \
    {PCAP04_REG_ADDR_14, PCAP04_SET_PRECHARGE_TIME_REG14(value)}

// PRECHARGE_TIME和寄存器15组合配置宏（一次性设置寄存器14和15，只需输入一次PRECHARGE_TIME值）
// 使用方式：在配置数组中展开为两个配置项（寄存器14和15）
// 说明：PRECHARGE_TIME值会自动设置到寄存器14[7:0]和寄存器15[1:0]，同时设置C_FAKE
#define PCAP04_PRECHARGE_TIME_AND_REG15_CONFIG(precharge_time, c_fake) \
    {PCAP04_REG_ADDR_14, PCAP04_SET_PRECHARGE_TIME_REG14(precharge_time)}, \
    {PCAP04_REG_ADDR_15, PCAP04_REG15_VALUE(precharge_time, c_fake)}

// FULLCHARGE_TIME (寄存器 16-17, 10位)
// 从寄存器值获取FULLCHARGE_TIME (reg_val_17是高2位，reg_val_16是低8位)
#define PCAP04_GET_FULLCHARGE_TIME(reg_val_17, reg_val_16) \
    (((uint16_t)((reg_val_17) & 0x03) << 8) | (reg_val_16))

// 设置FULLCHARGE_TIME的寄存器16 (低8位)
#define PCAP04_SET_FULLCHARGE_TIME_REG16(value) \
    ((uint8_t)((value) & 0xFF))

// 设置FULLCHARGE_TIME的寄存器17 (高2位，注意保留其他位域)
#define PCAP04_SET_FULLCHARGE_TIME_REG17(current_reg17_val, value) \
    ((uint8_t)(((current_reg17_val) & ~PCAP04_FULLCHARGE_TIME_MASK_REG17) | (((value) >> 8) & 0x03)))

// FULLCHARGE_TIME配置项生成宏（一次性设置寄存器16，寄存器17需要与其他位域合并）
// 使用方式：在配置数组中展开为一个配置项（寄存器16）
// 说明：FULLCHARGE_TIME值会影响寄存器16[7:0]（低8位）和寄存器17[1:0]（高2位）
// 注意：寄存器17还包含C_REF_SEL[6:2]，需要使用PCAP04_REG17_VALUE合并
#define PCAP04_FULLCHARGE_TIME_CONFIG(value) \
    {PCAP04_REG_ADDR_16, PCAP04_SET_FULLCHARGE_TIME_REG16(value)}

// FULLCHARGE_TIME和寄存器17组合配置宏（一次性设置寄存器16和17，只需输入一次FULLCHARGE_TIME值）
// 使用方式：在配置数组中展开为两个配置项（寄存器16和17）
// 说明：FULLCHARGE_TIME值会自动设置到寄存器16[7:0]和寄存器17[1:0]，同时设置C_REF_SEL
#define PCAP04_FULLCHARGE_TIME_AND_REG17_CONFIG(fullcharge_time, c_ref_sel) \
    {PCAP04_REG_ADDR_16, PCAP04_SET_FULLCHARGE_TIME_REG16(fullcharge_time)}, \
    {PCAP04_REG_ADDR_17, PCAP04_REG17_VALUE(fullcharge_time, c_ref_sel)}

// R_TRIG_PREDIV (寄存器 21-22, 10位)
// 从寄存器值获取R_TRIG_PREDIV (reg_val_22是高2位，reg_val_21是低8位)
#define PCAP04_GET_R_TRIG_PREDIV(reg_val_22, reg_val_21) \
    (((uint16_t)((reg_val_22) & 0x03) << 8) | (reg_val_21))

// 设置R_TRIG_PREDIV的寄存器21 (低8位)
#define PCAP04_SET_R_TRIG_PREDIV_REG21(value) \
    ((uint8_t)((value) & 0xFF))

// 设置R_TRIG_PREDIV的寄存器22 (高2位，注意保留其他位域)
#define PCAP04_SET_R_TRIG_PREDIV_REG22(current_reg22_val, value) \
    ((uint8_t)(((current_reg22_val) & ~PCAP04_R_TRIG_PREDIV_MASK_REG22) | (((value) >> 8) & 0x03)))

// R_TRIG_PREDIV配置项生成宏（一次性设置寄存器21，寄存器22需要与其他位域合并）
// 使用方式：在配置数组中展开为一个配置项（寄存器21）
// 说明：R_TRIG_PREDIV值会影响寄存器21[7:0]（低8位）和寄存器22[1:0]（高2位）
// 注意：寄存器22还包含R_AVRG[3:2]和R_TRIG_SEL[6:4]，需要使用PCAP04_REG22_VALUE合并
#define PCAP04_R_TRIG_PREDIV_CONFIG(value) \
    {PCAP04_REG_ADDR_21, PCAP04_SET_R_TRIG_PREDIV_REG21(value)}

// R_TRIG_PREDIV和寄存器22组合配置宏（一次性设置寄存器21和22，只需输入一次R_TRIG_PREDIV值）
// 使用方式：在配置数组中展开为两个配置项（寄存器21和22）
// 说明：R_TRIG_PREDIV值会自动设置到寄存器21[7:0]和寄存器22[1:0]，同时设置R_AVRG和R_TRIG_SEL
#define PCAP04_R_TRIG_PREDIV_AND_REG22_CONFIG(r_trig_prediv, r_avrg, r_trig_sel) \
    {PCAP04_REG_ADDR_21, PCAP04_SET_R_TRIG_PREDIV_REG21(r_trig_prediv)}, \
    {PCAP04_REG_ADDR_22, PCAP04_REG22_VALUE(r_trig_prediv, r_avrg, r_trig_sel)}

/**
 * @brief  PCAP04配置数组（64字节）
 */
extern unsigned char PCAP04_Config[64];
const unsigned char* PCAP04_GetConfig(void);

/**
 * @brief  打印PCAP04配置数组内容（用于PC环境调试）
 *         输出所有64个寄存器的地址和值
 * 
 * @note 使用标准C库printf输出，可在PC环境编译运行
 * @note 调用示例：PCAP04_PrintConfig();
 */
void PCAP04_PrintConfig(void);

typedef struct {
    uint8_t reg_addr;  // 寄存器地址 (0-63)
    uint8_t value;     // 寄存器值
} PCAP04_RegConfigItem_t;
int32_t PCAP04_BuildConfigArray(const PCAP04_RegConfigItem_t *config_items,
    uint8_t item_num,
    uint8_t *config_array,
    const uint8_t *default_array);

void PCAP04_InitConfig(void);
void PCAP04_PrintConfig(void);   /* 如果 verify_config.c 也要用 */
#endif // PCAP04_REGISTERS_H
